{"doc_id": 229377, "author": "Gilles 'SO- stop being evil'", "text": "The primary command to manipulate deb packages is dpkg-deb. To unpack the package, create an empty directory and switch to it, then run dpkg-deb to extract its control information and the package files. Use dpkg-deb -b to rebuild the package. mkdir tmp dpkg-deb -R original.deb tmp # edit DEBIAN/postinst dpkg-deb -b tmp fixed.deb Beware that unless your script is running as root, the files permissions and ownership will be corrupted at the extraction stage. One way to avoid this is to run your script under fakeroot. Note that you need to run the whole sequence under fakeroot, not each dpkg-deb individually, since its the fakeroot process that keeps the memory of the permissions of the files that cant be created as they are. fakeroot sh -c  mkdir tmp dpkg-deb -R original.deb tmp # edit DEBIAN/postinst dpkg-deb -b tmp fixed.deb  Rather than mess with permissions, you can keep the data archive intact and modify only the control archive. dpkg-deb doesnt provide a way to do that. Fortunately, deb packges are in a standard format: theyre ar archives. So you can use ar to extract the control archive, modify its files, and use ar again to replace the control archive by a new version. mkdir tmp cd tmp ar p ../original.deb control.tar.gz | tar -xz # edit postinst cp ../original.deb ../fixed.deb tar czf control.tar.gz *[!z] ar r ../fixed.deb control.tar.gz You should add a changelog entry and change the version number if you modify anything in the package. The infrastructure to manipulate Debian packages assumes that if two packages have the same name and version, theyre the same package. Add a suffix to the debian_revision part at the end of the version number; for sorting reasons the suffix should start with ~, e.g. 1.2.3-4.1 becomes 1.2.3-4.1~johnjumper1. Instead of using shell tools, you can use Emacs. The dpkg-dev-el package (which is its own upstream as this is a native Debian package) contains modes to edit .deb files and to edit Debian changelogs. Emacs can be used interactively or scripted."}
{"doc_id": 6, "author": "Adam Dempsey", "text": "You can use StartSound.PrefPane which basically just sets the volume to 0 when you shutdown and then turns it back up after login."}
{"doc_id": 131078, "author": null, "text": "http://abtevrythng.blogspot.com/2010/06/adding-cer-certificates-on-your-android.html Shows how to actually achieve this. Worked fine for me. Try it out. In this article .cer to .pfx (which is what you need on Android) conversion is given. Simple method is given using which you can convert .cer to .pfx and use it to connect to the Wi-Fi network. Plus you dont need any Key to convert .cer to .pfx!!!"}
{"doc_id": 65554, "author": "user132360", "text": "In App purchases are not shared in Family sharing and its clearly given in apple website. But what we can do is log in to iTunes & App store using the ID which was used to buy the in app purchases without having to change the primary ID of the device and still enjoy the in app purchases"}
{"doc_id": 34, "author": "Shane Stillwell", "text": "I would recommend installing QuickSilver. Its an application launcher that will remember the applications you launch most frequent and recommend them first. Its easy to launch any application with a few keystrokes. QuickSilver is the first Application I install on every new Mac."}
{"doc_id": 35, "author": "Scott", "text": "Not built-in to the OS, but Ive been using a free utility called Visor. What you do with it is leave your Terminal running in the background, but Visor hides it and invokes it in a Quake-style console when you hit a (user-configurable) key combo. Its pretty customizable as to how your Terminal shows/hides. Super awesome."}
{"doc_id": 37, "author": "jdiaz", "text": "If you enable screen locking within the screen saver pref pane you can put the computer to sleep and lock at the same time by pressing ⌘+⌥+F12"}
{"doc_id": 38, "author": "Josh K", "text": "⇧+⌘+⌥+Q will perform a quick logout. Another option is to enable a password when waking from sleep or screen saver and adding a hot corner for one or the other. Then locking is as simple as tossing a mouse in a corner."}
{"doc_id": 39, "author": "Scott", "text": "Via the Expose system preferences panel you can set a hot corner of your monitor that activates your screen saver. Say you set the Bottom Left corner, as soon as you move your mouse there the screen saver will invoke. If youve set a password on it, bingo, done. Yet another option is to enable Fast User Switching in the Login Options pane of the Accounts preferences panel. This puts a Users menu in the top right hand corner, from which you can quickly choose Login Window.... This kicks you to the login screen, requiring a password to move away from, and also does not end your session/quit any running apps."}
{"doc_id": 32805, "author": "TJ Luoma", "text": "I think the answer to your question is No, there isnt a command line way to do this. Because this is a menu bar item, its not something that you can access easily using Keyboard Maestro or another similar tool. However, if you are not averse to a solution using a 3rd party app, QuickLock will let you do this. Its a free (donations accepted) app which will let you assign a keyboard shortcut to lock the screen. Theres also a menu bar item which you can click to lock the screen. The app will let you set a password (separate from your account password). It does not require the use of password with screensaver, its all completely separate. You can see a video of it in action at http://www.youtube.com/watch?v=SBHwykPB19o p.s. when the screen is locked, type your password to unlock it. I was confused because I expected to see a password field. There is none. You just type the password. p.p.s. Ive only used this for a few minutes, so there may be some other issues with it Im not aware of, but it seems to fit the bill."}
{"doc_id": 44, "author": "zneak", "text": "Your Mac can ask your password after it wakes up if you set it to do so in the Preferences panel (Security). From there on, you can use ⌥+⌘+⏏ to put your Mac to sleep. So all you have to do is hit that and walk away."}
{"doc_id": 46, "author": "Nagon", "text": "On macOS High Sierra, there is a standard key sequence and Apple menu item to lock your screen. Control-Command-Q or ^+⌘+Q For older OS, ⇧+⌃+⏏ puts the display (only the display, not the whole computer) to sleep and will then prompt you for a password if you have enabled Require password [amount of time] after sleep or screen saver begins under System Preferences > Security. If your Mac does not have an ⏏ (eject) key, you can use ⇧+⌃+⌽ (power)."}
{"doc_id": 589874, "author": "WoJ", "text": "Of course it is not, as other answers pointed out. Your first efforts should go into changing the requesters mind. If you are, despite your efforts, somehow forced to provide your password - get that request in writing. You can then reply, also in writing, that you will provide the requester this information in a sealed enveloppe and that from that moment on you are not responsible for any actions performed via this account, whose password just became public knowledge at the request of management. It is likely that you have in the past accepted (directly or indirectly) that you are in charge of the account, which is accessed by a password you are the only one to know. You have also probably accepted that you would not share this account."}
{"doc_id": 557112, "author": "Randall Krieg", "text": "Heres another bit of evidence you can trust DDG if youre paranoid: they make it easy to control what information gets sent to the target host when you follow a link. Maybe you cant really know what theyre keeping in their logs, but you CAN know how they treat your interaction with the link targets, and you can control it if you like. Try this on both DuckDuckGo and Google, with Javascript enabled: 1. search for something 2. hover over one of the result links and check the address in the status bar 3. right-click one of the links, and look at the address in the status bar again On DuckDuckGo, the links are what they say they are. If you want to keep DuckDuckGo from seeing what youre clicking on, and if you want the target to be unaware that you came in via DuckDuckGo, you can do so easily: just copy the link in step 3, paste it into your address bar, and there you are -- no further interaction with DuckDuckGo and no referrer URL sent to the target site. On Google, however, note that in #2 they show you the link you expect, but in step #3 the link suddenly changes to a google.com address with a ton of gobbledeygook. This is also the address that gets used if you click the link normally. The only way to get the real target address directly is to hover over it and retype it yourself instead of clicking it. The Google client-side script is specifically designed to make sure you hit the Google tracking server before being redirected to the page you really wanted, and moreover, TO HIDE THE FACT THAT IT IS DOING SO from the vast majority of users. This is the action Google took a few years ago that finally caused me to use DDG exclusively. I understand Googles need to monetize its service, but when it purposely hides this fundamental mechanism they prove they are not trustworthy. So you can have your choice: use a site that says its not tracking you, and seems to be carrying out its promise; or use a site that tracks you every way it can, tells you its doing so, and makes it as hard as possible to evade it. The choice is obvious."}
{"doc_id": 62, "author": "Chealion", "text": "Taken from my answer at Server Fault: Mac OS X Memory Jargon: Wired : This refers to kernel code and such. Memory that should not ever be moved out of the RAM. Also know as resident memory. Shared : Memory that is shared between two or more processes. Both processes would show this amount of memory so it can be a bit misleading as to how much memory is actually in use. Real : This is the real memory usage for an application as reported by task_info() - a rough count of the number of physical pages that the current process has. (RSIZE) Private : This is memory that a process is using solely on its own that is used in Resident memory. (RPRVT) Virtual : The total amount of address space in the process thats mapped to anything - whether thats an arbitrarily large space for variables or anything - it does not equate to actual VM use. (VSIZE) Active : Memory currently labelled as active and is used RAM. Inactive : Inactive memory is no longer being used and has been cached to disk. It will remain in RAM until another application needs the space. Leaving this information in RAM is to your advantage if you (or a client of your computer) come back to it later. - Mac OS X Help Free : The amount of RAM actually available without any data. The best documentation I know of (and have been able to find in followup research) is Apples own Managing Memory article on their developer website. Other worthwhile sources: Darwin-dev mailing list: [1], [2] and an old article on MacOSXHints. Additionally Mike Ash has posted a good laymans introduction on his blog"}
{"doc_id": 163903, "author": "HRJ", "text": "None of the solutions mentioned here are working as of Feb 2018. So I created my own simple solution which I will document below. TL;DR: use AppBrains API. The long answer Create a folder called appSearch, for example. Sign up for an account on AppBrain. Then go to your dev dashboard. It will prompt you to enable the Developer option for your account. Navigate to the API access page. Copy the authentication field, which looks like di=xxxx&t=zzzzz and store the values into a file called appBrain.json in the following format: { DI : xxxx, TOKEN : yyyy } Now download filter.js and save it to the same (appSearch) folder. Install Java 8+ Run the following command: jjs -scripting filter.js -- keyword, where keyword can be any search term. You should see a list of 50 apps that match your search term and are sorted by the number of permissions, with a link to their play store page. Edit: The code in filter.js is relatively simple and can be tailored to suit your own criteria, if you know a bit of programming. I will try to make it more configurable in the future. The free tier allows limited number of queries per day. Still, you will be able to make about 30 searches per day, which is enough for personal use."}
{"doc_id": 64, "author": "Robert S Ciaccio", "text": "Real mem relates to physical memory (actual RAM modules in your computer). Virtual Mem is how much fake memory is allocated to the process, meaning memory that is allocated on the permanent storage medium (hard drive, solid state drive, etc) for that process. Shared memory is physical (Real) memory that can be shared with other processes. Private memory is real memory that can only be used by the process it is allocated to. These explanations may help as well... directly from activity monitor --> help --> viewing system memory usage: Here is an explanation of some of the information displayed at the bottom of the memory pane: Wired: Wired memory contains information that must always stay in RAM Active: Active memory that contains information that is actively being used. Inactive: Inactive memory contains information that is not actively being used. Leaving this information in RAM is to your advantage if you (or a client of your computer) come back to it later. Used: Used memory is being used by a process or by the system. Used memory is the sum of wired, active, and inactive memory. If the system requires memory it takes free memory before used memory. Free: Free memory is not being used and is immediately available. VM size: Virtual memory, or VM, is hard disk space that can be used as memory. VM size is the amount of disk space being used as memory. Mac OS X can use more memory than the amount of physical RAM you have. A hard disk is much slower than RAM, so the virtual memory system automatically distributes information between disk space and RAM for efficient performance. Page ins/outs: The number of gigabytes of information Mac OS X has moved between RAM and disk space"}
{"doc_id": 70, "author": "Asbjørn Ulsberg", "text": "If you want to be able to remote control your Mac (with Synergy or something similar) even when its locked, Id recommend you to show the Keychain Status in the Menu Bar. You do that as follows: Launch the application Keychain Access Press ⌘, to open up the Preferences window Tick the Show Status in Menu Bar check box Click the newly appeared lock icon in the menu bar Click Lock Screen to lock the screen This will lock the screen with a login window, but still make the Mac possible to remote control. If you dont need to remote control the Mac, MacLoc is a simple and effective solution."}
{"doc_id": 262219, "author": "Andrew Henle", "text": "No, a UUID cant be guaranteed to be unique. A UUID is just a 128-bit random number. When my computer generates a UUID, theres no practical way it can prevent your computer or any other device in the universe from generating that same UUID at some time in the future. It may not be likely that any two UUIDs will be the same, but they can be. In this case, the code assigning UUIDs to devices may check a new UUID against any existing UUIDs already assigned to devices and throw away duplicates, guaranteeing uniqueness that way. Regarding uniqueness. When a new disk is installed to a system, the usual practice is for a technician to define the partitions thereon. Labels are not unique and are not used. In the definition process, a software algorithm creates a UUID. As the system already has a list of existing mounted UUIDs, the process of defining the partition automatically creates a unique UUID value. The new UUID value filtered against the existing list of mounted UUIDs so as to avoid duplication. With partition creation,on the host system that UUID coupled with the partition number form a unique combination. Yes really. Duplication could occur if the disk is prepared on system A for use on an existing system B."}
{"doc_id": 196692, "author": "Dimitry", "text": "This is more correct: find . -iregex .*\\.\\(jpg\\|gif\\|png\\|jpeg\\)$"}
{"doc_id": 426073, "author": "aceinthehole", "text": "Consulting/Contracting No one has mentioned the particular case of consulting/contracting. If you are in this category or you would like to be, this can definitely help you. You are easier to sell on a project if your boss or sales guy can pitch you as being certified in niche category X. That being said you are not necessarily better or more knowledgeable on a particular topic if you are not certified, and I agree with others who might take a dubious take on them in general. Although, having a few MS certifications I can say for you, if you crank on them on a technology that you are trying to learn, it really forces you to get up to speed."}
{"doc_id": 65630, "author": "Motsel", "text": "For all the googlers... check out Beyond Compare it rules. Costs 30$ or 50$ for Pro version."}
{"doc_id": 65632, "author": "Jaime Santa Cruz", "text": "The optimization feature is supposed to free up space automatically by keeping low res versions of your pictures. From the Apple support site: If you turn on Optimize [device] Storage, iCloud Photo Library will automatically manage the size of your library on your device, so you can make the most of your devices storage and access more photos than ever. All of your original, full-resolution photos and videos are stored in iCloud while device-size versions are kept on your device. You can download the original photos and videos over Wi-Fi or cellular when you need them."}
{"doc_id": 295009, "author": "Dennis Estenson", "text": "man pages can be very informative. Dont be intimidated by them. Among everything else, man less says you can use the R command to: R Repaint the screen, discarding any buffered input. Useful if the file is changing while it is being viewed. (I realize this question is over 6 years old, but it comes up on google searches, so Im not the only one that clicked the link to get here.)"}
{"doc_id": 32866, "author": "iolsmit", "text": "I use BetterTouchTool for that purpose and assigned a keyboard shortcut to Switch to login screen (which is lock screen): doesnt fulfill the command line requirement but may be helpful to you anyway."}
{"doc_id": 99, "author": "NReilingh", "text": "As of Snow Leopard, this actually is built into the OS. Launch Automator and create a service that receives no input from any application. From the Actions Library, add the Launch Application action to the workflow. Select the Terminal application in the drop-down list of Applications. Save your new service and then assign a keyboard shortcut to it in: System Preferences -> Keyboard -> Keyboard Shortcuts -> Services"}
{"doc_id": 295015, "author": "starfry", "text": "The shortest and simplest way to delete the first line from a file using sed is: $ sed -i -n -e 2,$p file.txt"}
{"doc_id": 107, "author": "intlect", "text": "ctrl+F2: Access the menu via the keyboard (Windows alt+space equivalent)."}
{"doc_id": 393325, "author": "MIA", "text": "Either work to well defined sprints, or deliberately choose a Kanban approach. Dont accidentally end up in Kanban Bugs first, features second. Still keep a focus on Value vs. feature bloat. (YAGNI over Gold Plating) Retrospectives are just as valuable. And just as importantly, make process changes in small chunks. Dont decide that today youre going start to go TDD, Mock and IoC in one shot unless you really have no external features to deliver ATM. Bring one in at a time. Ultimately, I define Agile really as doing what makes sense for your team and customer and not adhering to old practices because they happened to look like they worked in the past."}
{"doc_id": 110, "author": "Jacob Gorban", "text": "⌘+E: Put selected text into search clipboard. Then ⌘ + G to find next. In combination with regular copy-paste you can do selective search and replace very quickly and conveniently."}
{"doc_id": 111, "author": "Eimantas", "text": "ctrl+⌥+⌘+8: High contrast theme. ⌘+` (backtick): Cycle through apps windows."}
{"doc_id": 114, "author": "robsoft", "text": "I havent noticed that sound on my MacBook Pro for ages, and today I figured out why. The MBP seems to remember 2 sets of volume settings; both for having-no-headphones-plugged-in, and for having-headphones-plugged-in. I usually have my external speakers plugged in-when Im at home, and when Im travelling/way from home obviously I dont. At some point in the past I have turned the volume down to zero when headphones werent connected, and now when I start the MBP up theres no sound. You could try this (though its not particularly practical) - turn the volume on your Mac right down to zero, then restart the computer. I suspect you wont hear the startup-sound. Like I say, not really practical but if the start-up noise annoys you enough, you might just get into the habit of turning the volume down before switching off. :-) EDIT: Just realised this this point about turning the volume down has already been made in other answers here, so feel free to ignore this!"}
{"doc_id": 262258, "author": "mrjamesmyers", "text": "My resolution was similar to Roman Ts however I needed to add a few extra steps. In my case I had Ubuntu Server 14 VM running on a Windows 8 Desktop in Windows 2008 domain. If I tried NAT or Bridge I could access the Internet but couldnt connect via SSH. If I tried Host Only Adapter then that would allow me to SSH to machine but couldnt access the Internet. I tried Port forwarding as well and no joy. Opened up Wireshark and it just wasnt finding VM. So my solution was to add a second network adapter. Method With VM powered down Click Settings > Network Click Adapter 1 and choose Bridged Adapter Click Adapter 2 and choose Host Only Adapter Click File > Preferences > Networks Under NAT Networks if you dont see a NAT Network click on + icon to add NAT Network. Click Host-Only Networks if you dont see a host only network click + icon to add one Start up VM In order to see network adapter you need to type ifconfig -a You may see the network adapter is added with a mac address but not an IP? If so then you need to edit /etc/network/interfaces in order to configure DHCP. Example below using VI/VIM but you can use editor of your choice sudo vi /etc/network/interfaces add the lines auto eth1 iface eth1 inet dhcp save and exit file. Then try restarting network service using below command sudo service networking restart Or if that fails then restart VM. Once restarted type below to see if you eth1 has been allocated an IP address ifconfig -a if so then see if you can SSH on to the VM"}
{"doc_id": 119, "author": "Am1rr3zA", "text": "⌘+⇧+4: selective screenshot saved on desktop ⌘+⇧+ctrl+4: selective screenshot saved in clipboard"}
{"doc_id": 65657, "author": "William T Froggard", "text": "You can, but its a major security and stability risk. Doing so allows any application full access to your computer. You cant know what theyre doing with that access. Its unnecessary, and just really unsafe. For a lot more background information on this, see Why is it bad to login as root Why not run always logged in as root Why it is not recommend to use root login in linux"}
{"doc_id": 121, "author": "Studer", "text": "ctrl+A: Go to the beginning of the line (works in every Cocoa textfield) ctrl+E: Go to the end of the line (works in every Cocoa textfield) ⌘+⇧+H : Pop up the Home folder ⌘+⇧+D : Pop up the Desktop folder"}
{"doc_id": 65661, "author": "David Anderson", "text": "Generally you want to keep ownership of your personal files separate from the root user. This is why you create a account for yourself as an administrator. The accepted way, under OS X, to gain root level access is to use the sudo command from the Terminal application. For example, if you want to see the partitioning of your internal drive the command is gpt -r show /dev/disk0 which if entered will result in the following error message. gpt show: unable to open device /dev/disk0: Permission denied To use the command, you need to use sudo as shown below. sudo gpt -r show /dev/disk0 If you want to become the root user to avoid entering sudo, you can just enter sudo sh. The exit command can be used to exit from being the root user. If you want to execute an application as the root user, you can by using the Terminal application. For example, if you want to launch the Finder as the root user, enter the following command. sudo /System/Library/CoreServices/Finder.app/Contents/MacOS/Finder & To avoid the confusion of having two Finder applications open at the same time, it is usually best to quit your Finder application first. This can be done using the following terminal command. osascript -e tell application Finder to quit One word of caution: preceding a command with sudo is not the same as becoming the root user. For example, the commands sudo echo $USER sudo echo $SUDO_USER result in the same output as the commands shown below. echo $USER echo $SUDO_USER If you become the root user (the superuser), then the same commands result in a different output. This can be verified by entering the commands shown below. sudo sh echo $USER echo $SUDO_USER sudo echo $USER sudo echo $SUDO_USER exit"}
{"doc_id": 65662, "author": "Humberto Morales", "text": "Open the Terminal, you can find typing Spotlight in Terminal, and copy and paste this sentence there: rm -r /Users/$USER/Applications/Chrome\\ Apps.localized/"}
{"doc_id": 129, "author": "daefu", "text": "With the track pad, you can configure gestures for locking your mac. I do it with a four finger swipe left. To confiugre this, you need a (free) tool like the BetterTouchTool."}
{"doc_id": 131203, "author": "mattdm", "text": "Android shares very little with a typical Linux distribution. In fact, this is where Richard Stallmans GNU/Linux distinction comes in handy — Android isnt really a Unix-like general purpose operating system with a Linux kernel. Its a new system which happens to use the Linux kernel. This goes all the way down to its own custom libc implementation (called Bionic), which does not necessarily attempt POSIX compliance. This article from ZDNet covers a talk which gives a pretty good overview of the system, and although its a couple of years old its still basically correct and helpful."}
{"doc_id": 557187, "author": "sergiogarciadev", "text": "Yes, your company can monitor your SSL traffic. Other responses say that SSL is secure, indeed it is. But, your corporate proxy can intercept and inspect your encrypted traffic as denoted by the image below: This image is when I visit Google in my work computer. Here, they use the Forefront Threat Management Gateway 2010 which can intercept the connection between me and a secure site. Explanation: The SSL (Secure Socket Layer) and TLS (Transport Layer Security) security is based on PKI (Public Key Infrastruture). The PKI consists on a series of trusted certificates called root certificates. Here in my company, one of the root certificates is the certificate which Forefront generates the certificates for each website I visit. Because my computer trusts the certificate which the proxy used, no warning was generated and the connection is done securely but can be inspected by the proxy server."}
{"doc_id": 133, "author": "Tom H", "text": "⌘+space: activate spotlight. Then you can launch any application, open most files, do quick calculations, etc."}
{"doc_id": 65686, "author": "David Richerby", "text": "Using your computer logged in as root all the time is like always carrying around all your keys, your passport, $5,000 in cash, that piece of paper with all your passwords written on it and the only photo you have of Flopsy, the adorable rabbit whose death broke your seven-year-old heart. Oh, and a chainsaw. Which is to say, its mighty convenient from time to time, because it means you can do whatever you want, whenever you want, without needing to go back home to get stuff or talk to your bank manager. But it also puts you at great risk of losing stuff, having it stolen (dont think that chainsaw will help you: youll be streets away before you notice your wallets gone), doing things you really regret later (impulse-buying plane tickets to Vegas while drunk), taking dangerous shortcuts (chainsawing through the lion enclosure fence because thats the fastest way to the pandas) and over-reacting (chainsawing your neighbours car because his dog barks too much). And, when you think about it, mostly, youre just going to the office, going grocery shopping, hanging out with your friends. You dont need all that stuff with you all the time just for the convenience of needing it, what?, once a month? Once a week? So, no, its not OK to use the root account all the time. It gives you a tiny amount of convenience but puts you in a lot of danger. Theres the danger of stupid mistakes having catastrophic results (Hey, why is rm -rf * taking so long to run? **** Im in /!). Theres the danger of acclimating yourself to the idea that all files are equal and you can just mess about with whatever you want, anywhere in the directory tree. Theres the danger that any hack to your account is immediately a hack to the whole system, so now every single piece of software on your machine is security-critical. And even if you think you dont care about your machine getting hacked (after all, that photo of Flopsy is a real piece of glossy paper, not some ephemeral JPEG), I care about your machine getting hacked because then its on the botnet thats mounting the DDOS attack against whatever internet service I cant access today. Root is your spiderman costume. It gives you great power but requires great responsibility. Its there in the closet whenever you need it, so you dont have to wear it all the time."}
{"doc_id": 65689, "author": "alexwlchan", "text": "Quoting from an Apple support article about Personal Hotspot (emphasis mine): When you connect a device to your Personal Hotspot, the status bar turns blue and shows how many devices have joined. The number of devices that can join your Personal Hotspot at one time depends on your carrier and iPhone model. I believe the typical limit is usually between 3 to 5 devices."}
{"doc_id": 98462, "author": "pepper_chico", "text": "Save the following AppleScript to a file named fullscreen.scpt: use framework AppKit use scripting additions repeat with runningApp in current applications NSWorkspaces sharedWorkspaces runningApplications() if runningApps isActive() set frontApp to (localizedName of runningApp) as text exit repeat end if end repeat tell application System Events tell process frontApp to set isFullScreen to value of attribute AXFullScreen of first window if frontApp = Finder tell process frontApp to set value of attribute AXFullScreen of first window to not isFullScreen else if isFullScreen do shell script lsappinfo setinfo -app  & quoted form of frontApp &  ApplicationType=Foreground tell process frontApp to set value of attribute AXFullScreen of first window to false (*fix to make sure the menu bar is not stuck*) delay 0.42 tell application Finder to activate tell process frontApp to set frontmost to true else do shell script lsappinfo setinfo -app  & quoted form of frontApp &  ApplicationType=UIElement tell process frontApp to set value of attribute AXFullScreen of first window to true end if end tell From terminal, compile it to an application with the following command: osacompile -o /Applications/Full Screen.app fullscreen.scpt Open the Full Screen.apps Info.plist (e.g. vim /Applications/Full Screen.app/Contents/Info.plist) and add the following to the dict: <key>NSUIElement</key> <true/> Add Full Screen.app as an exception in System Preferences > Security & Privacy > Privacy > Accessibility. Launch Automator and create a new Service. Change Service receives to no input in any application. Add a Library > Utilities > Launch Application action. Configure the action to launch the previously created Full Screen application. Save the service as Full Screen and close Automator. On System Preferences > Keyboard > Shortcuts > Services, scroll down to the bottom of the list and the just created Full Screen service should be listed there. Associate an unique Command shortcut for it, like Shift+Command+\\ or Command+F11 for example. This creates a shortcut to cause an application to enter full screen while removing the menu bar, or to exit full screen bringing the menu bar back. It provides an alternative full screen shortcut! For application-specific full screen launchers, check my other answer. Caveats There may be some disadvantages and/or misbehavior using this approach: It works by setting ApplicationType=UIElement, which causes the application icon not be added/highlighted in the Dock and make the application inaccessible via Command+Tab. The Command+Tab issue was reported in comments, I didnt notice it since I mostly use the Mission Control overview to change between full screen applications. It may not behave as expected for some specific applications, Ive noticed issues with the Activity Monitor application (which is generally not used full screen anyway) and theres a report on Chrome, which I didnt try since I use Firefox and it works great."}
{"doc_id": 426148, "author": "nsanders", "text": "I think having good challenges and learning opportunities is critical. Thats true when youre above the junior level too."}
{"doc_id": 426149, "author": "schwerwolf", "text": "The opportunity to work alongside experienced programmers."}
{"doc_id": 426150, "author": null, "text": "I personally like the office my company gave me."}
{"doc_id": 426151, "author": "Ryan Farley", "text": "I always love going to conferences and training and consider that a perk. Not all companies pay to have their devs continue to learn. Theres always more to learn. You benefit because they are learning more. They benefit from that too, but also have fun and get away from things for a couple of days and get to mingle with other devs."}
{"doc_id": 426152, "author": "Aaron", "text": "be flexible about the starting hour."}
{"doc_id": 426153, "author": null, "text": "Two flat-screen monitors, an optical mouse -- two things I dont currently have -- and each their own whiteboard with a few markers."}
{"doc_id": 426154, "author": "theo", "text": "Flexible Schedule Good PTO Program Fun & Exciting Technology/Toys Relaxed Work Atmosphere A great idea would be to let all your devs design their own workspaces. Different people need different environments to be productive."}
{"doc_id": 426155, "author": "Lucas S.", "text": "The opportunity to work alongside experienced programmers. And also the possibility of learn from them."}
{"doc_id": 426156, "author": "Peter Hilton", "text": "Philip Greenspun wrote about this once. He suggested making the office a better place to be than home, which is easier for young programmers. For example, domestic hardware that someone living alone cannot justify: expensive coffee machine, pool table, huge TV with DVDs to watch. Make the office more sociable: put beer in the fridge and have a drink together at the end of the day. Provide better food (easy for people who cant cook): get deli deliveries or a caterer."}
{"doc_id": 426157, "author": "BCS", "text": "Good hardware: Id be very interested if I was told that I would get a desktop system (WinXP is still my system of choice) and a Linux server box. Something I have root on and can run services on (local at a minimum, world visible would be nice.) A Virtual private server in the company data center instead of dedicated hardware would also work. Another thing that would be nice would be access to good references: We will buy you any books that are apropos to your job! same with software to some point, if its under $60, we will just get it. Edit: large screenS on pivot stands, good chairs, white boards, etc."}
{"doc_id": 426158, "author": null, "text": "The access to training and mentors. The things that Junior developers want is pretty much what every programmer that I know wants. They want to work in a relaxed and flexible environment with people who are at least as smart as them if not smarter. They want to feel like they are a part of something. They want to constantly be learning. Make sure that you have a training/book budget. Make sure that they are always learning and always have something interesting to work on. Make sure that you do team building or some kind of thing like that on a fairly regular bases. Lunch and learns are an increasingly popular tool these days. One thing that Junior Developers might like more than more Senior developers is the use of cutting edge or even bleeding edge technology. Be careful about this one, cause it can byte you in the butt, but it always helps."}
{"doc_id": 426159, "author": "shadit", "text": "Give them each a budget and let them configure their own computer setup. Make them submit a plan for what they intend to purchase. Talk over the plan with them. It will be a great way to kick things off. Give them a budget for a cell phone and unlimited plan that the company will pay for. Pay for their home Internet service. Little things like these they will show their friends to the response of, Cool - I wish my company did that!"}
{"doc_id": 426160, "author": "Brian", "text": "Treat them as peers"}
{"doc_id": 426161, "author": null, "text": "One nice perq we have here (beyond training, great environment, and the rest) is subsidized gym membership."}
{"doc_id": 426162, "author": null, "text": "give them responsibilities and some degree of freedom. make them feel like they are developing something for themselves, with passion"}
{"doc_id": 426163, "author": "MarlonRibunal", "text": "Being able to work remotely + flexible hours, Tech books give-a-way, and lots of love!"}
{"doc_id": 426164, "author": "BCS", "text": "Lets them, on company time, do some private projects (things that could be useful for the company, but things they get to pick)"}
{"doc_id": 131246, "author": "Wesley Wiser", "text": "Check out Official Android Developers Dashboards. Data as of September, 2017 1 Version Codename Distribution 2.3.3-2.3.7 Gingerbread 0.6% 4.0.3-4.0.4 Ice Cream 0.6% Sandwich 4.1.x Jelly Bean 2.4% 4.2.x 3.5% 4.3 1.0% 4.4 KitKat 15.1% 5.0 Lollipop 7.1% 5.1 21.7% 6.0 Marshmallow 32.2% 7.0 Nougat 14.2% 7.1 1.6% 1 Data collected during a 7-day period ending on September 11, 2016. Any versions with less than 0.1% distribution are not shown. (Note: Beginning in September 2013, devices running versions older than Android 2.3.3 do not appear in this data because those devices do not support the new Google Play Store app. As of August 2013, devices with versions lower than 2.2 accounted for about 1% of all devices.)"}
{"doc_id": 426166, "author": "Kenny Mann", "text": "Im currently slightly experienced but I still call myself junior. Here is what I appreciate of my employer: Buys me books. I have a diverse taste from C# to perl to C to Asm to database design to tsql etc. Book prices vary from $20 to $50. This usually requires a PO and approval and such. Allows me to critique current projects. Ive re-written a few project to be MUCH cleaner through the experience I gain. Each time I document why I made those changes. Every now and then I re-write my re-writes. Its amazing to see how much you change. I do this one on my own. I initiated it. A fast computer and a 24 monitor. This actually helps a lot, but for any developer. Less frustration and more code on the screen. Monitor also rotates for those kinds of days."}
{"doc_id": 426167, "author": "Mitchel Sellers", "text": "There are a number of things that come to mind, and not even for junior people. Training packages for use with conferences, certifications, or something similar. Showing a dedication to future growth in the field Provide flexiable starting times especially to those just getting out of college and not used to working a day job if In an environment where they must work from home, help them out a bit there, subsidize internet service, and/or company cell phone. If you must have access to them, giving them a way to do it helps."}
{"doc_id": 426168, "author": "Max Cantor", "text": "In my experience, good programmers want to program with as few distractions as possible. Some of these are more relevant to big companies, and Im not sure where you work, but here are some examples: Casual dress code: Young programmers in particular will have a tough time avoiding resentment of a strict dress code. Im just going to sit at my desk all day--why do I need to wear slacks/polos/other uncomfortable business clothes? In my opinion, this is half rebellion and half honest productivity-seeking: It really is much easier to program in jeans and a t-shirt than slacks and a formal button-down. The question you probably need to ask yourself is if the potential productivity gain and morale boost is worth the potential loss of professional atmosphere. It all depends on your situation... there are startups and Fortune 500 companies out there which allow jeans & t-shirts. Few meetings: Almost nothing is more distracting than a constant stream of meetings. Try to avoid team-wide status meetings that could be carried out via individual e-mails or conversations. Programmers like it when their employer lets them program. Experienced coworkers: Good programmers want to improve. If any of your other employees have contributed to big open source projects, or have worked individually on some particularly successful internal projects, let your prospectives know! Private offices: This is rarely practical anywhere but venture-capitalized startups, but if you can offer candidates their own offices, theyll leave the interview with hearts in their eyes. Programming is so much easier when you arent distracted by foot traffic and people singing happy-birthday one cube over. Cool stuff: If you can afford it, subsidize games for lunch breaks and post-work hang out sessions. Best practices: This will ensnare good programmers and intimidate less experienced ones: Show that your candidates will be working with reliable, sane version control, and that there are coding standards about unit tests or inheritance or anything. Organization is important. Dont nickel-and-dime: If you can be flexible with hours, do it! No one likes having to clock out every time they go to the restroom; it feels like youre not being valued as an employee. Dual monitors: Instant win for almost any programmer whos worked with dual monitors before."}
{"doc_id": 426169, "author": null, "text": "Work from home. (for voting)"}
{"doc_id": 426170, "author": null, "text": "Casual dress (for voting)"}
{"doc_id": 426171, "author": null, "text": "Private offices (for voting)"}
{"doc_id": 426172, "author": null, "text": "Good hardware (for voting)"}
{"doc_id": 32957, "author": "krishan", "text": "You can now simply go to System Preferences > App Store, and turn off Automatically check for updates. No messing with firewalls, and just works with App Store. So just remember to check every now and then manually to find out when you have updates!"}
{"doc_id": 426174, "author": "CrashCodes", "text": "Admin rights to their PCs An internet connection thats not gimped by bizzaro proxy rules Dual Monitors Work from home privileges A soda fountain (not a drinking fountain that dispenses soda instead of water ala Brawndo, but like youd use at the Taco Bell to refill your drink)"}
{"doc_id": 32958, "author": "David Holdeman", "text": "Safari being two processes When a site has some javascript that hangs the web content process, I can still add new tabs, navigate in other tabs, etc."}
{"doc_id": 426176, "author": "benPearce", "text": "My company has purchased an OReilly Safari Online account for each of our developers. I have access to thousands of books online at any time. We also have training videos available at online from CBT Nuggets but I find their content limited. Also, some productivity tools, for Visual Studio, such as CodeRush/Refactor Pro or Resharper Quality Coffee in-house."}
{"doc_id": 426177, "author": "John Rudy", "text": "When I was just starting out, I benefited greatly from the mentoring of others in the office. It helped a lot, and I viewed it as a serious perk -- I was often quoted as, Im getting paid to learn! There are all the trivialities (games in the office, DVDs, etc.) -- I think that while they make for a great interview carrot, theyre not a reason said programmers will stay. Indeed, once their work ramps up, theyll probably realize they have little time for those perks and wonder why the company even bothers. As a junior, learning from someone who respects you, is able to teach you and is able to lead you is very enticing long-term. It may not have the interview sex appeal that the others do, but its something I think all serious developers did appreciate (or would have appreciated, if they didnt get it). Sponsor a corporate-wide subscription to Safari. Allow a junior dev to take 2 or 3 hours a day learning. Make him feel valued. Let him contribute. Which is another biggie: Make him feel like part of the team, and give him projects which not only interest him, but also challenge him. Too often, the junior dev gets the jobs like move control X to the lower right corner, or write all the property routines (or getters/setters in Java/Obj-C/et al), or add javascript validation. Give him something to do which makes him feel useful, like a real contributor. Hell appreciate that, too -- and probably become more passionate about your firm and your practices. (BTW, my use of him is not meant to be sexist; its just a shorthand. Please expand it to him/her mentally.)"}
{"doc_id": 426178, "author": "Cade Roux", "text": "Good project management - with minimal BS and meetings under control Good technical mentoring Book reimbursement, resources, tools And I take issue with the aside from cash I think cash isnt really ranked up that high unless the environment is so poor - thats why they call it compensation."}
{"doc_id": 426179, "author": null, "text": "Invite your whole team to the restaurant of their choice every Friday for lunch. A former boss of mine used to do just that and it really helped team bonding. If budget doesnt allow it, you can do it once every two weeks or once a month. But think of the value of having closer team members."}
{"doc_id": 426173, "author": "skiphoppy", "text": "The chance to devote time to learning. Give them the chance to spend longer than expected for a task so that they can pore through books and search across the net to learn the best way to do things. Give them OReilly books. Encourage them to spend time reading them. Encourage them to make connections online and become familiar with sites such as this one where they can learn the habit of trying to program well instead of trying to program just to get done. Yes, thats a perk. For them as well as for you. :)"}
{"doc_id": 426181, "author": "Asmor", "text": "Speaking as an actual college student (senior), heres some things Id like: A degree of direction (tell me what you need done) A degree of autonomy (trust me to get it done) Im probably unusual among my peers in that I prefer professionalism. As a general rule of thumb, I think casual dress would be very helpful, though it wouldnt be a huge issue for me personally. But really, the big thing is trust, and letting me do what youre paying me to do. If I think Im going to be stuck attending constant meetings and always worrying about office politics, thats a big strike against you. Competence is also very important... I dont know if I could work for a manager who knew nothing about programming. I understand that its entirely likely a great manager might not even be as good a programmer as I am, but they should at least know enough to know whats feasible and whats not. Oh, and probably the biggest thing for me: Long term prospects. I hate job hunting, and Id tolerate an otherwise-mildly intolerable job if I knew that I wasnt likely to be laid off, out-sourced, etc."}
{"doc_id": 65734, "author": "sudo", "text": "In case the other reasons werent good enough... Dont forget that you cant use Homebrew as root (which is actually a huge pain). Other programs also dont let you use them as root or run into permissions problems when you do, often times for no apparent reason, because their programmers assume that they wont be run as root. I think Steam is one of them. Its also nice to have all the system and user stuff separate for various reasons. I dont know if its that bad of a security issue. Id personally be more worried about problems with organization and permissions than anything else."}
{"doc_id": 426183, "author": "JB King", "text": "Casual dress code Free pop (This was one that I really liked back in the dot-com days and miss it sooo much) Flextime and telecommuting Configure there own machine w/dual monitors and a budget Benefits like health care, dental and vision - Some of us like being able to get a discount on glasses or having our teeth checked. I would also suggest making sure there is a clear process for how work will be done as junior programmers may not necessarily be aware of all the best practices and what kind of environment you want to give them."}
{"doc_id": 426180, "author": null, "text": "In addition to what has been said, make sure you have them work on stuff that has impact on the business. If they feel that you value their work as a core part of your business, they might become much more engaged in their projects. If they do, thats the kind of developers you want full time."}
{"doc_id": 426185, "author": null, "text": "Experience with experienced programmers. Games, free food, free massages, are just gimmicks (cough google cough)"}
{"doc_id": 426186, "author": "Dipak Patel", "text": "Im surprised the cynics amongst us havent said non brain-dead leadership! Attracting young people with toys is a bit patronising, better to say: Yeah so we could offer you lots of new shiny toys, but how about we guarantee you no PHBs instead? ;-)"}
{"doc_id": 426187, "author": "Yaba", "text": "Give them the choice of tools as far as possible. I know its not always possible, but I guess there is nothing more demotivating than forcing a Linux guy to use Windows, a MAC Guy to use Windows, or a Windows Guy to use Linux. Of course thats not always possible, but also what about favourite email clients? Some love thunderbird, others outlook and others mutt."}
{"doc_id": 393420, "author": "Toon Krijthe", "text": "I have participated in two big rewrites. First was a small project. The second was the main product of a software company. There are several pitfalls: rewrites always take longer than expected. rewrites have no direct effects/benefits for the customer. capacity devoted to rewriting isnt used to support the customer. you will lose functionality with a rewrite unless you have 100% documentation. Rewrites are seldom the real answer. You can refactor much of the code without losing anything and without a lot of the risk. Rewrites can be the answer if: you are switching to another language or platform. you are switching frameworks/external components. the existing codebase is not maintainable anymore. But I strongly advise the slow approach using refactoring. Its less risky and you keep your customers happy."}
{"doc_id": 426188, "author": "Ben Collins", "text": "The best equipment: chair monitors modern workstation (e.g., nothing older than 2 years) ergonomic keyboard Matching 401k (the higher the match, the better) Good mentoring. Freedom to pursue creative outlets related to work projects (i.e., 20% time). Update: after reading other answers, I think Id also say: private office individual book/training budget HDHP with the amount of the deductible given at the beginning of the year in the form of an HSA"}
{"doc_id": 426190, "author": null, "text": "In my opinion this will be great perks for new programmers. Though it would also be awesome things to have for any programmer. :) Smarter and more experienced developers from whom you can learn from Good software engineering practices that is used throughout the company Exciting projects (though this might just come along after you find that the developer is fit for the job at interview time) A friendly and supportive environment Dual monitors A comfortable chair (since you will be spending most of your day sitting down), and ergonomic keyboard/mouse A programming books library, and the chance to request more books to add to the collection Lunch time or after work gaming sessions Clean kitchen with a decent coffee machine On top of that there is an extra big plus for passing the Joel Test. I am not too keen myself to give/have an own office. Mostly because lots of programmers are very sociable people, and it would be good to have some interaction during the day. However, that might just be a personal choice."}
{"doc_id": 393423, "author": "Ryan Hayes", "text": "Its time for a rewrite when: The cost of rewriting the application + maintaining the rewritten application is less than the cost of maintaining the current system over time. Some factors that make maintaining the current one more expensive: The language is so old you have to pay people that know it a lot of money to program in it (COBOL). (from experience, unfortunately) The system is on a hardware architecture that is so old that they have to scour Ebay and COLLECT parts to add to the machine it is running on because they arent made anymore. This is called hardware life support and is expensive because as parts become more scarce, they (may) go up in price or they (absolutely) will eventually run out. It has become so complex that the //Here be dragons. comment is all over your code. You cant write any other projects and add new value to the company because youre always patching this ugly beast."}
{"doc_id": 426189, "author": null, "text": "There were lots of good suggestions already. I did a quick search on the all the response I cant find these so Im including these 1. Good health insurance coverage from the employer. 2. Paid time off. it really helps to re-boost employees."}
{"doc_id": 426191, "author": null, "text": "A decent manager, good training, and good motivation would be nice. In all of my past jobs, the training sucked, the managers didnt care, and they ended up motivating me right into a new job. Treat your employees well, and the perks will matter less. (But free food never hurts, either :))"}
{"doc_id": 426192, "author": null, "text": "One thing that would be very appealing is if an employer offered to sponsor one non-work interest for each employee. This could be something simple, like paying for karate classes or offering a small scholarship for those who are taking night classes for a graduate degree. I think that contributing to making an employee a more well-rounded person will actually pay dividends for the employer in the end. Team outings are fun, help bring people together and act as much-needed breaks when projects get intense. Offering even bi-monthly events could be a nice incentive."}
{"doc_id": 426194, "author": null, "text": "Lunches out - on the company, of course...with beers. After work beers on Fridays. Beer is the key."}
{"doc_id": 426195, "author": null, "text": "I think the biggest perk for a new programmer is when they first join the company they have a plan and know exactly what there career road map is. When I first started my current job I was given some interesting work right from the start and I knew exactly what was expected of me. Other fresh graduates were left to school themselves up which ultimately helped them to loose interest in the work completely. Other gimmicks like a big screen etc are great but they dont make a boring job any better!"}
{"doc_id": 426196, "author": null, "text": "A chance to be part of a successful team."}
{"doc_id": 426198, "author": null, "text": "interesting work. When I started programming many years ago, you got lumped with the crap work as no one else wanted to do it."}
{"doc_id": 393431, "author": "Michael Meadows", "text": "Sorry, this is going to be long, but its based on personal experience as both architect and developer on multiple rewrite projects. The following conditions should cause you to consider some sort of rewrite. Ill talk about how to decide which one to do after that. Developer ramp-up time is very high. If it takes any longer than below (by experience level) to ramp up a new developer, then the system needs to be redesigned. By ramp-up time, I mean the amount of time before the new developer is ready to do their first commit (on a small feature) Fresh out of college - 1.5 months Still green, but have worked on other projects before - 1 month Mid level - 2 weeks Experienced - 1 week Senior level - 1 day Deployment cannot be automated, because of the complexity of the existing architecture Even simple bug fixes take too long because of the complexity of existing code New features take too long, and cost too much because of the interdependence of the codebase (new features cannot be isolated, and therefore affect existing features) The formal testing cycle takes too long because of the interdependence of the existing codebase. Too many use cases are executed on too few screens. This causes training issues for the users and developers. The technology that the current system is in demands it Quality developers with experience in the technology are too hard to find It is deprecated (It cant be upgraded to support newer platforms/features) There is simply a much more expressive higher-level technology available The cost of maintaining the infrastructure of the older technology is too high These things are pretty self-evident. When to decide on a complete rewrite versus an incremental rebuild is more subjective, and therefore more politically charged. What I can say with conviction is that to categorically state that it is never a good idea is wrong. If a system can be incrementally redesigned, and you have the full support of project sponsorship for such a thing, then you should do it. Heres the problem, though. Many systems cannot be incrementally redesigned. Here are some of the reasons I have encountered that prevent this (both technical and political). Technical The coupling of components is so high that changes to a single component cannot be isolated from other components. A redesign of a single component results in a cascade of changes not only to adjacent components, but indirectly to all components. The technology stack is so complicated that future state design necessitates multiple infrastructure changes. This would be necessary in a complete rewrite as well, but if its required in an incremental redesign, then you lose that advantage. Redesigning a component results in a complete rewrite of that component anyway, because the existing design is so fubar that theres nothing worth saving. Again, you lose the advantage if this is the case. Political The sponsors cannot be made to understand that an incremental redesign requires a long-term commitment to the project. Inevitably, most organizations lose the appetite for the continuing budget drain that an incremental redesign creates. This loss of appetite is inevitable for a rewrite as well, but the sponsors will be more inclined to continue, because they dont want to be split between a partially complete new system and a partially obsolete old system. The users of the system are too attached with their current screens. If this is the case, you wont have the license to improve a vital part of the system (the front-end). A redesign lets you circumvent this problem, since theyre starting with something new. Theyll still insist on getting the same screens, but you have a little more ammunition to push back. Keep in mind that the total cost of redesiging incrementally is always higher than doing a complete rewrite, but the impact to the organization is usually smaller. In my opinion, if you can justify a rewrite, and you have superstar developers, then do it. Only do it if you can be certain that there is the political will to see it through to completion. This means both executive and end user buy-in. Without it, you will fail. Im assuming that this is why Joel says its a bad idea. Executive and end-user buy-in looks like a two-headed unicorn to many architects. You have to sell it aggressively, and campaign for its continuation continuously until its complete. Thats difficult, and youre talking about staking your reputation on something that some will not want to see succeed. Some strategies for success: If you do, however, do not try to convert existing code. Design the system from scratch. Otherwise youre wasting your time. I have never seen or heard of a conversion project that didnt end up miserably. Migrate users to the new system one team at a time. Identify the teams that have the MOST pain with the existing system, and migrate them first. Let them spread the good news by word of mouth. This way your new system will be sold from within. Design your framework as you need it. Dont start with some I-spent-6-months-building-this framework that has never seen real code. Keep your technology stack as small as possible. Dont over-design. You can add technologies as needed, but taking them out is difficult. Additionally, the more layers you have, the more work it is for developers to do things. Dont make it difficult from the get-go. Involve the users directly in the design process, but dont let them dictate how to do it. Earn their trust by showing them that you can give them what they want better if you follow good design principles."}
{"doc_id": 426199, "author": null, "text": "A quality chair aeron chair http://www.hermanmiller.com/hm/content/product_showroom/products/images/P_AER_L146_W.jpg"}
{"doc_id": 426200, "author": "Jerry", "text": "Dont throw them in with the general population. Give them a place with some degree of privacy, where they can concentrate and not be constantly distracted by phones, business conversations and foot traffic. Try to give them specified projects with finite, tangible requirements. Give them goals to achieve, instead of open-ended projects that leave them at the mercy of business types who refuse to ever commit to a specification. Have and enforce a change request policy. Have and enforce a clearly defined chain of command that requests have to flow through. Make sure they have more experienced programmers to aspire to and seek advice from. I would take these things over foosball tables and free soda any day."}
{"doc_id": 426201, "author": "Devin Jeanpierre", "text": "Hey, well, Im still in university, so I guess I might be qualified to answer! I can tell you what would attract me personally to a job, but I cant really speak in general terms. For me, the most important thing is interesting work. I dont want to maintain a 40 year-old accounting system. I do want to do something challenging and fun. Maybe thats a bit much to ask for, but I would expect others to ask for it as well. I think this leads a lot of programmers into the game development industry, and apparently they get burned out there, so thats not cool-- but that doesnt mean other development cant be fun. It would depend, obviously, on the person involved. Id love to do things like image manipulation and simulations (and, yes, game development), but I havent gone deep into other areas. The number one pulling me into a job would really be the fun aspect-- cheap things like a dedicated wii room and comfortable clothes do help, but neither will make me want to take a job fixing the remaining y2k bugs, or whatever else needs doing."}
{"doc_id": 393435, "author": "Jay", "text": "I think Im in the only situation in my career where the big rewrite is the answer: Company merger, huge overlap in systems functionality. Many, many systems have been merged and retired, and others still in the process. Ive inherited a system from the other company that still lives on. It has a huge code base, which used to support multiple departments very similar to our own, but with a completely different design and frameworks. There is only one business sector left using it, which makes enough money that keeps this thing alive in a zombie state. All the old expertise is gone, there is no documentation. The support burden is high, with failures every week. It has not been merged into our companies systems, because our company never supported this particular sector of the business, so we dont have the functionality or expertise. It looks like this is the one case where the rewrite is needed. It looks like Im going to have to figure out this behemoth, pull out the bits of functionality dedicated to this business, and rewrite the pieces that need to be added to our existing systems. Once that is done, our existing systems can support this new sector, and this beast can be put out of its misery. Otherwise Im going to lose my sanity."}
{"doc_id": 426204, "author": null, "text": "Smart people and cool projects would attract the best programmers. IMO, if you rely only on monetary incentives, youll most likely attract the wrong crowd."}
{"doc_id": 426205, "author": null, "text": "Freedom to make mistakes and learn Knowledgable and tolerant team members Great hardware and a single widescreen monitor"}
{"doc_id": 426202, "author": null, "text": "The type of people youd like to hire tends to be a first-order concern when deciding what sort of perks to offer. For the programmer whos thinking about or in the process of raising a family, paternity leave, company matching of adoption funds up to $X/year, flexible vacation and working hours, and a sense of job security may be much more attractive than a soda machine and free Segways for all. You mention that youre looking for junior or young programmers, but many young folks do still fall into this category. I sense, however, that by young, you might mean too young to be into that whole work-life balance thing. Lets call this The Google Strategy. The idea here is to make it so it just doesnt make sense to their analytical minds to ever leave work. Have on-site services like free food, drink, and laundry, provide gathering places for informal conversations. Make them feel like theyre the rock stars of the company, and theyll repay you with long hours and hard work. The good news for you is that these types of perks dont cost you much at all relative to the increased hours theyll be willing to put in. The bad news is that this model tends not to be sustainable, and this dot-com era irrational exuberance no longer satisfies your programmers when they start to want to take vacations, get married and go on a long honeymoon, have kids, and so forth. At that point, they want flexibility, more vacation time, a 401k, etc. Besides the first one, these all cost significant coin. Heres the most important point though: if youd like to hire the absolute brightest people you can find, dont try to outsmart them. Odds are, the really sharp ones will be a little less interested in the size of the Free Red Bull Fridge and the number of air hockey tables at their disposal, than whether youll value them as an asset to the company and as an individual (both in terms of compensation and employer/employee relations in general), whether you have a sustainable business model/plan, whether your work really excites them, and whether your work really excites you. Id suggest reading a couple essays on Joel On Software, he treats the subject of hiring good programmers in a fair amount of detail (Smart, and Gets Things Done, I think, is the name of one of the essays). While your question certainly isnt without merit, and providing a work environment with some of the same perks as your competitors will make your sales pitch somewhat easier, the only people that will be truly swayed by these kinds of things are not the people you want the success of your small company to depend on. Good developers want to feel like theyre making a contribution to something that matters, like their skills are valued and put to good use, like they are responsible to their peers and to themselves. Focus on having a truly great, dynamic company that does great work, and that treats its technical people with respect (things like private offices help here, too), and youll really attract the type of people youre looking for. (Thanks to Thomas Kammeyer for a tip on the last paragraph!)"}
{"doc_id": 426203, "author": null, "text": "I am a recent graduate. In my opinion, the most appealing perk for me is having an interesting project to work on. I dont want to be writing simple in-house enterprise applications all day. This may be someone elses idea of fun. However, it is not mine."}
{"doc_id": 426206, "author": "coder1", "text": "Programmers need vacation. Lots of it. Four weeks a year to start. Minimum."}
{"doc_id": 426208, "author": null, "text": "The option to install whatever software you need to get the job done. Notepad++, Pownce or whatever."}
{"doc_id": 426209, "author": "Rob", "text": "Heres something: Dont leave them in the dark when they are just starting. They will be very uncomfortable if they have no direction when they start. Make sure they have very, very clearly defined tasks with measurable deliverables. When I first started, I was throw into a mess of a product with no direction and told to fix bugs that made absolutely no sense to me. Find somewhere appropriate for them to work and make sure you give them what they need to contribute positively. Otherwise youre just going to have a bunch of college kids surfing the web on your dime."}
{"doc_id": 426210, "author": "coder1", "text": "A career path. Not that they necessarily have to follow it, but give them the thought that they dont have to be a junior forever, and show them that there are opportunities in the company. Give them an idea of what it takes to advance."}
{"doc_id": 426211, "author": null, "text": "Training is by far the #1 thing. It was when I was starting out. Company funding for books and/or conferences. Time to work on projects that might not directly be a product but can help in advancing skills (and could possibly turn into a product). Time with Senior level developers/mentors."}
{"doc_id": 426212, "author": "Joshua Carmody", "text": "Be flexible with office hours. If a programmer gets his best work done between 1:00pm and 10:00pm, or he has other classes or some other reason to need flexible hours, why force him to work 9:00-5:00? Naturally you may need programmers in the office at certain times for mentoring/training/code review/important meetings, etc. But most programmers appreciate flexibility where it can be found."}
{"doc_id": 426214, "author": "rpattabi", "text": "There is nothing like the company of an experienced fellow programmer guiding the new programmer. I am always thankful to my very first mentor when I entered into software development. (Thanks Chris!)"}
{"doc_id": 426213, "author": "JohnMcG", "text": "A boss who would ask this question."}
{"doc_id": 426215, "author": "Nathan Koop", "text": "I would argue against private offices, I would promote more of an open office concept with war rooms so that the the newbs can quickly ask a more experienced person quickly & easily. But keep the rooms smaller, five or less people. Also, dual or triple monitors is a must."}
{"doc_id": 426217, "author": null, "text": "Perks? Mentors: Single greatest asset i was given. Someone who showed me the ropes, listened to me, took me aside when i messed up, explain why (not how) things were done. Someone who had knowledge of the product (not a HR/PR person), or could distill something in ten minutes or less. Sometimes new people are afraid to ask questions. Goals & Salary: When your programmers start, have them write down three goals theyd like to achieve in three months. They dont need to be climb mount Everest, write a compiler type goals. But They must measurable. Its a great tool to find motivated people. Fitness Bonus Where i work, if you can accumulate 500+ km in one year biking to work, the company will write you a check for $500, just like that. Its great way to encourage this whole being green thing and helps relieve stress and saves money. The Best Tools Provide programmers with the best tools. I cant tell you how much resentment I felt was I was told that VS2003 was too expensive, but all the sales staff had blackberries. It made me feel undervalued and i eventually quit. Perk time Allow your coders 20% of there time to work on their own projects. Its a great way to spur ideas, and helps keep people motivated."}
{"doc_id": 426216, "author": "MikeJ", "text": "Perks that I have liked: 1) a book budget to get technical books related and unrelated to the job 2) assigned mentor - someone more senior to help show me the ropes and tell me about the culture 3) pop/snack area with minimal (better is no cost) to staff 4) notebook,wifi and lounge where you can be more relaxed when you arent coding hard but still working on things like email. our company has 4 of them than you can pick up in the lounge and curl up on the couch and read mail etc during lunch or during an unwind time 5) budget for movie tickets, dinner out etc. to give to staff after they have done a grinder or delivered a key element on time - anything to make them feel special and remembered for hard work"}
{"doc_id": 426218, "author": "Jeremy Cantrell", "text": "In my opinion, the best perk a new programmer can have is a good mentor who is extremely knowledgeable and understanding."}
{"doc_id": 426220, "author": "Jim In Texas", "text": "I think private offices are overated, especially for junior developers. OTH managers must understand that every time a developer is distracted by noise, people walking around them, or being in a huge bullpen or a sea of cheap cubes that it costs the firm money in the near term. Good work areas, especially good chairs and monitors, make a huge difference. Any kind of dress code beyond naughty bits must be covered is insane when applied to developers. Having non-flexible work hours is insane when applied to developers. In general what is known in management theory as Taylorism is a good way to drive away the best developers. All developers, especially junior developers, appreciate formal training opportunities."}
{"doc_id": 426221, "author": null, "text": "Shower on the premises, so that employees can jog/cycle to work."}
{"doc_id": 426222, "author": null, "text": "Free coffee Good nearby food Well stacked library"}
{"doc_id": 426223, "author": null, "text": "Apart from the hard stuff like offices, tools, gear, food and snack Id like to add something that makes me feel special: Let your developers in on decisions! If youre getting new tools for them, or moving or starting a new project or even hiring new people -let your developers in on those decisions. Its only fair you get a say in who your new coworker is or what the next big thing you are going to work for a few years on. One way to do this is to conduct meetings in a round table fashion where you specifically ask every attending person for their opinion, not just let them speak up if they wish."}
{"doc_id": 426224, "author": null, "text": "Besides money, the greatest attraction for a new developer would be an experience that will allow him/her to build his career on strong footings. A developer can get this experience by working in an environment that will allow him to learn, improve, strive to achieve challenges, where quality (of code, documents, etc) has some value, where best practices are followed, where people look for a better solution and most important point is - No internal politics."}
{"doc_id": 65773, "author": "bodangly", "text": "Just a few examples why its not ok to always run as root: Root user can easily place files in locations that are far more difficult to track down. Root user has raw access to interfaces and so can put an interface into promiscuous or monitor mode and log ALL network traffic. Root user has raw access to device nodes and can thrash a disk making it far harder to recover files than a simple rm at user level. Root user can also potentially modify boot sectors of a drive, making malware persistent even after a reinstall of the operating system. I could go on. The point is that there ARE good reasons not to run as root. I dont disagree that to most people their most personal data is in their home directory anyhow, but running as root still does put that data, and the entire system, at a greater risk. The advice to not run as root is not misplaced. If a person does not understand the implications of running as root, they definitely should not be doing so. Suggesting anything else is irresponsible."}
{"doc_id": 426226, "author": "prasanna", "text": "Being a college student who would go for job in a few short years, Id say its definitely Casual dress code -- why does my dress matter when I can program good enough? Mentoring -- some older, wiser programmers to guide you. Id just have been out of college, used to having a professor around the corner or a TA to throw questions at. Friendly/productive atmosphere -- Id like to have people who will discuss codes after their job and not make me go to really stupid meetings that dont get things done. Boss that understands programming -- Ive been surrounded by all CS people who think in similar ways and understand me. Id want to have a boss to be similar. Gym/Fitness membership... -- It just helps to vent off pressue of programming.. Some resources to work on own projects -- I would want to do some of my own things, even after office hours if required.. Id be glad to use to company resources. Please please, root on my PC.. or admin -- I know what I do, please give me rights.."}
{"doc_id": 426227, "author": null, "text": "Simply follow Jeff Atwoods (PBUH) Programmers Bill of Rights and they will come. It doesnt hurt to provide abundant caffeination infrastructure as well :)"}
{"doc_id": 426228, "author": "Jasper Bekkers", "text": "These are all personal :-). Free coffee. I have solved countless problems while waiting for my coffee to finish, or even walking to the coffee vending machine. Laptops. I dont care about fancy dual monitor setups everyone keeps mentioning because I usually end up working on only one of them anyway. However, having a laptop and being able to work from any part of the company more valuable to me. I can just take my problem with me and it makes it easier for me do demonstrate what is going on to a college. Smoking area. I smoke, and although I dont smoke that much, its really nice to actually spend five minutes somewhere else. The most interesting discussions I have with peers are usually while smoking. Open office. I dont like to sit in an office, by myself, for a prolonged length of time because it makes me feel like a machine. To me, interaction with peers is a huge motivation to go to work. Whiteboard and artistic people around. If there are any webdesigners, 3d modelers, sound guys or whatever type of artsy people you can find; put them in the same room as the programming / tech guys. This too makes the job seem less mechanical. No dress code. Ill quit the day someone will try to make me wear a suit. They honestly dont make me feel comfortable, besides that, I probably wouldnt fit in such a formal culture anyway. Besides that, Im a pierced up coding goth that delivers the best work when I dont have to worry about something other than code. That include clothing. Learning opportunity. Doesnt matter what, it could be seminars, peer reviews, book, research time, anything goes. If the job requires concurrent programming: a dual core machine at least. A stash of ritalin, lol. I dont care about: Dual monitor setups. As stated previously; they distract me so, I tend to prefer widescreens. Fast hardware; it hard these days to actually get slow hardware these days. Gadgets. Free internet at home, or a cell phone. I already have those. The editor, IDE or OS I have to use as long as I can figure out how to work with it in an hour or two (it usually takes less time though). Huge paychecks. Give me a pleasant working environment where Im happy to be for the biggest part of the week and Im happier than when I have a huge pile of money stashed away at the bank. Use that cash to improve the office conditions. Game rooms, guitars, pooltables, foosball or airhockey tables et cetera."}
{"doc_id": 426229, "author": null, "text": "Well, working on challenging and interesting projects, being respected and not being ignored (some junior developers are just forgotten in a corner of the office) can be better than throwing them games and gadgets."}
{"doc_id": 426230, "author": null, "text": "Im a current college student, graduating in about a year, and the only thing that matters is respect. Money, hours, aeron chairs, multiple moniters, admin rights to your own computer, private office, telecommuting rights, these all represent the same thing: the employer views you as a real employee. Clock ins, lowball offers, drug tests, cubicle farms, folding chairs, ect., these all represent the opposite: the employer views you as a stupid little kid. The most intelligent and hardworking graduates are probably not as interested in the free soft drinks and game lounges as they are in the idea that they will be viewed as important contributors, both to your company and the field of software engineering at large."}
{"doc_id": 426231, "author": null, "text": "Independence , and a feeling that their Inputs matter Work From Home Allow for Personal work at Office (initially there might be lot of wasteage of time , Slowly it will come down automatically) Casual Dress code Laptops and Not workstations Creative projects Allow them to Work on Other things not limited by Work Profile (Like a new programmer wold cherish the idea of having the liberty to directly interact with the Clients and Understand / Solve Problems) All this would be grt for them , And would think twice before leaving as they would feel suck would place would not be available elsewhere."}
{"doc_id": 426232, "author": "mscccc", "text": "Gym Membership Video Games Dual Monitors 4 weeks+ of vacation Flexible starting hour If no private office then noise cancelling headphones. And MOST importantly other people their age to work with. When you are 22-23 years old it is really hard to relate to your coworkers when they are all talking about their kids/families."}
{"doc_id": 458998, "author": "HLGEM", "text": "There is no one right answer to this. It depends on what you use the database for. In an enterprise application, you need the logic in the database through foreign keys, constraints, triggers, etc. because it is the only place where all possible applications share code. Further, putting the required logic in code generally means the database is inconsistent and the data is of poor quality. That may seem trivial to an application devloper who is only concerend with how the GUI works, but I assure you that the people trying to use the data in compliance reports find it very annoying and costly when they get billion dollar fines for having data that didnt follow the rules correctly. In a non-regulatory environment when you dont care as much about the whole set of records and only one or two applications hit the database, maybe you can get away with keeping it all in the application."}
{"doc_id": 426234, "author": "slim", "text": "bright colleagues interesting challenges flexitime freedom to fail (if you never fail, youre not being challenged enough) freedom to innovate (i.e. an organisation that doesnt stonewall ideas from juniors) Google-style 20% time -- or something similar the sense that attending conferences and education is encouraged, not merely allowed casual dress code dining facilities on site or very nearby I would suggest that working from should not be the norm for junior hires - they need face to face contact in order to become part of the team. Its good if they have the facilities to work from in order to do out of hours work, or have occasional home days."}
{"doc_id": 557306, "author": "Duncan Jones", "text": "The other answers do an excellent job explaining the maths behind the key exchange. If youd like a more pictorial representation, nothing beats the excellent paint analogy shown on the Diffie–Hellman key exchange Wikipedia entry: Image is in the public domain"}
{"doc_id": 426236, "author": "BenAlabaster", "text": "Some of these have been mentioned before, while others seem to have been skipped over... A bluetooth headset - preferably one that multi-pairs with my desk phone and my cell phone and lets me listen to music in stereo. Less is more, right? I dont want to have to keep switching headsets to answer different phones or listen to my music, and I definitely dont want to have to hold the receiver while I try and continue my daily work - and I dont want half a dozen gadgets cluttering up my desk, the fewer the better. OReilly Subscription - I think this costs me $40 a month which Id rather not pay for myself, but I refuse to live without it, so I do. MSDN License - The one with all the nifty stuff like Expression Studio, Visual Studio Team Edition etc. This currently costs me a small fortune, it would be nice if it came as a perk of my job! Software - Dont give me hassle about purchasing software that will make me more productive when I ask - XmlSpy, Icon Workshop, Resharper/CodeRush just buy it and bring it to me when it arrives, the small amount of $$$ it costs, by the time youve wasted a half hour of my time having me write up justification and youve wasted another 10 minutes reading it, weve just spent more than the cost of the software. Flex Time/Telecommuting - If I arrive late, chances are I didnt leave until late last night, dont quiz me like a five year old where I was at 8:30 when everyone else arrived! Where were you and everyone else at 2am when I left? Give me leeway to be myself. Putting my feet on my own desk is perfectly acceptable behaviour, as is listening to music, eating, having pop on my desk etc. As long as Im not disturbing anyone elses workflow and Im meeting all my deadlines/objectives, thats all that matters. Home internet connection and VPN privileges - for those work from home days. Time to think - without questioning what Im doing instead of working - were programmers, thinking is working, whats more, thats what you pay us for. Bookshelf - for all my books Books - to put on said bookshelf. No micromanaging - Im an adult, I dont need micromanaging! Give me a task and some kind of idea of the direction you want me to take and leave me to do what you hired me for. If you wanted to do the job yourself, be my guest I can always find something else to do. If I need help, Ill ask. A forum for answering questions/learning Training/Seminars/Further Education (i.e. Masters Degrees, PHds etc) Life Insurance Policy Stock Options RRSP/401K Occasional Team Building Days - Sailing, War Games, Paintball, whatever you like And if you wanted to throw in a couple of nice personal perks: Gym Membership Golf Club Membership"}
{"doc_id": 295165, "author": "ANTHONY", "text": "Type: history -c; rm ~/.bash_history history -c clears your current sessions history, rm ~/.bash_history clears your long term history, so history -c; rm ~/.bash_history clears both."}
{"doc_id": 426238, "author": null, "text": "Quality chairs. A developer spends a lot of time during the day sitting. While a good quality adjustable chair may seem expensive, its cheaper than having a developer miss work because their back is injured from sitting in an Office Depot $79 special. In office catering. It doesnt have to be covered by the company, but having a secretary make a lunch run for the office is a great benefit. Not only does it enable the developer to work through their lunch, if they need/ want to, but it helps cut down on that time lost before lunch where everyone tries to coordinate about whos going where. Dual monitors, or one large(30+) high resolution widescreen format LCD. The productivity gain from having multiple monitors is amazing. Imagine a secretary having to work in an office with only a single file cabinet with just one drawer. Thats what development on a single 17 4:3 aspect ratio monitor is like. Quiet. Even if you cant afford private offices for the developers, providing the developers with a space separate from marketing and people whose jobs are to talk to your customer base, or the sales team is very important to a developer. A developer has chosen to work with computers, and not people, because they are likely not an extrovert. Therefore, keeping them sheltered from the sales teams pep-talks and team building exercises will be very valuable. If you have to have a giant open floor plan for the entire business, look at getting some banners or sound dampening to hang from the ceiling. Respect. Your developers are building the tools that your company uses to be more profitable. They may be making the software you sell, or the software that gives your company the advantage you need to be competitive, treat them with respect. Books. Developers need knowledge like plants need water. If a developer isnt given an outlet to learn new techniques and practices, they will search for it themselves. Give your developers a quarterly library fund, or have a company library they can get books from, and request new books be added to. You can create an internal website which the developers can vote for new additions to the library with, and buy them once a quarter. A subscription to an online library resource like Safaribooks.com A sense of being appreciated. You chose to hire these particular developers for a reason. Make them feel like they are special in some way. Have a quarterly/ monthly guest speaker, as you can afford it. If you cant afford a guest speaker, send some of them to conferences and workshops. Rotate your developers through conferences, so that everyone has the opportunity to go. Managers who understand what is involved in developing software. Developing software is not the same thing as digging a ditch or laying bricks. A developer will not spend 8/8 hours writing code. Plenty of time will be spent on research, whether requirements gathering/ clarification, or on the right approach to solve a particular problem. In physical engineering, prototypes and stepwise refinement are part of the iterative development of a product. The same is true in software. Just because the final check-in for a task is only a few text files, doesnt mean that the developer didnt spend a lot of effort refining that feature or bug fix. Guidance. As a recent college grad, your new developers are going to need someone whos been around to guide them to the correct technologies and practices to use to increase their value, both for the company and for themselves."}
{"doc_id": 426237, "author": null, "text": "casual dress will have to be up on the list for me. i used to work for an employer who would on occasion stock our department mini fridge with caffine (in our senerio it was Mountain Dew). the most important thing to me was chemistry. having coworkers that were intellegent enough to bounce ideas off of but social enough where we could invite each other to bar bqs. finally, i think being comfortable. i think the casual dress is a small preface to this, however, good chairs, good screens, performing machines, lowest stress conditions possible. being a developer deadlines are already enough to stress out about."}
{"doc_id": 426240, "author": "Ramy", "text": "In a few words, Id say room for growth. Im not the great hacker that most of the people on this site probably are (at least the ones with over 10k rep - I have yet to successfully answer a question after being here for a year). So for me, when I was starting out, I knew that college was, effectively, nothing. And I needed to do all my learning in the real world. Sure I got my CS degree, but I was way behind all the other CS majors because I didnt play with computers when I was young. I had hardly ANY experience with FILE SYSTEMS, for Gods sake, before I got to college. So, how do you create room for growth? To me, I think you have to create a professional, fun, AND academic environment. Professional meaning the usual things you read about in a business-type book (respect, clear expectations, blah blah). Fun meaning, aside from games, putting together a group of people who can sit in a room together and just shoot the breeze and be mostly laughing. Academic meaning an environment where everyone is a student and everyone is a teacher. This is probably the most difficult to foster in my opinion for any number of reasons."}
{"doc_id": 426235, "author": null, "text": "I just entered the job market and landed with a company where the hours (with the exception of occasional deadlines) are 9-5, 3 weeks vacation to start, and free lunch monday - thursday from different restaurants. This beat the other places that essentially said they would treat me like dirt and have me work long hours. The hours and benefits allow me to maintain a very healthy work/life balance, and this makes me more productive at work. Oh yeah, and dual monitors rock."}
{"doc_id": 491773, "author": "Miguel van de Laar", "text": "SOAP can be used without WSDL, but such services will not be found using the discovery mechanics offered by WSDL. WSDL could be used to describe any form of XML exchange between two nodes. So other formats of XML can be used. REST services can be described using WSDL version 2.0. An example of how to desribe REST services in WSDL 2.0 can be found here. See also this question on StackOverflow."}
{"doc_id": 164117, "author": "wbogacz", "text": "Google is making it easier, as reported today, to change the country to a different one. From Android Police on 2018/03/20: Now, Google appears to be taking one teeny tiny step toward making the switch easier for some people. If your Play Store country is set to country A (whether you lived there or, uhm, fooled Google into thinking you did because you made a purchase with a valid payment method and to a valid shipping address in that country), and the Play Store detects that youve moved to country B (likely based on your IP address), youll get a new option in the Account settings: Country and profiles. There youll see which country your Store account is on and an option to quickly switch to the new country - provided you have a valid payment method there. There are some caveats to this: Keep in mind that this Country and profiles option wont be there for everyone and wont let you switch to any country you want. It appears to only show up when it detects a discrepancy between your setting and your IP address."}
{"doc_id": 33053, "author": "James Fernandes", "text": "You can always try the Matrox DualHead2Go Digital ME. I use the Mini DisplayPort version and it works well except it can get quite fussy when I try to resume from sleep. Of course, Im using it with the MBP lid closed; it doesnt seem to have this problem when the lid is open. One other note: the device makes both monitors appear to the Mac as being a single, giant monitor. However, I havent really had any issue with this myself."}
{"doc_id": 196895, "author": "Dan", "text": "For all intents and purposes, CentOS is RedHat. CentOS, however is more flexible in what they can do. From the CentOS website: CentOS is developed by a small but growing team of core developers. In turn the core developers are supported by an active user community including system administrators, network administrators, enterprise users, managers, core Linux contributors and Linux enthusiasts from around the world. CentOS has numerous advantages over some of the other clone projects including: an active and growing user community, quickly rebuilt, tested, and QAed errata packages, an extensive mirror network, developers who are contactable and responsive, multiple free support avenues including IRC Chat, Mailing Lists, Forums, a dynamic FAQ. In a nutshell, CentOS is a community version of RedHat. You use Ubuntu, so you may understand this analogy a bit better: CentOS is to RedHat as Linux Mint is to Ubuntu."}
{"doc_id": 393511, "author": "blucz", "text": "If a developer showed up at an interview with a bunch of certifications on his resume, I would develop serious doubts as to his value system. There are zero situations in which Id value time spent obtaining a certification over time spent working on a project. Any project."}
{"doc_id": 557356, "author": "Lighty", "text": "Long answer: According to Microsoft, Winmail.dat is a file that keeps the rich-text formatting readable if sent by Outlook. I have sniffed around a bit and found out that attachments that act like the way Winmail.dat does exist. Then again, since its an attachment (and I hope you dont auto-open attachments from emails), you should only open it if you trust the person that send it to you, or have a good anti-virus that can scan your mail too. Short answer: yes, attachment malware called winmail.dat exists, exploitation of a valid file is possible, because it basically contains theming. More info on winmail.dat can be found on this website: http://support.microsoft.com/kb/278061"}
{"doc_id": 196908, "author": "pradeepchhetri", "text": "You can get this working by using: TEST=foo && echo $TEST"}
{"doc_id": 304, "author": "g .", "text": "⌘+⇧+N: Create a new folder in Finder"}
{"doc_id": 196913, "author": "gertvdijk", "text": "Use netstat. For example $ netstat -nputw Active Internet connections (w/o servers) Proto Recv-Q Send-Q Local Address Foreign Address State PID/Program name [...] tcp 0 0 192.168.25.222:22 192.168.0.134:42903 ESTABLISHED 32663/sshd: gert [p lists all UDP (u), TCP (t) and RAW (w) outgoing connections (not using l or a) in a numeric form (n, prevents possible long-running DNS queries) and includes the program (p) associated with that. Consider adding the c option to get output being updated continuously."}
{"doc_id": 305, "author": "Tobias Cohen", "text": "⌘+⇥: Cycle through running apps ⌘+`: Cycle through windows for current app ⌘+W: Close current window ⌘+Q: Quit current app ⌘+,: Preferences dialog for current app ⌘+H: Hide current app (as long as its not Photoshop) ctrl+⇧+⏏: Sleep all displays"}
{"doc_id": 196915, "author": "Kratos", "text": "netstat is a good option.Use the parameters as required.(see its man pages) For example netstat -antup Here it can monitor all(a) listening numeric (n) tcp (t) and udp (u) process (p). You can also try the ss command . For reference use : SS Linux TCP / UDP Network and Socket Information"}
{"doc_id": 196917, "author": "Stéphane Chazelas", "text": "If you just want to just log every connection attempt, the easiest is probably iptables LOG target on Linux (or the equivalent firewall logging feature on your system). If you need more information like duration of the connection and amount of data exchanged in both directions, then conntrackd (on Linux) is probably the best option. However note that those two above only log the traffic that goes through netfilter, which is generally all the traffic but doesnt account traffic generated with IP stacks in user space (like virtual machines or anything using raw sockets) or bridged traffic. For more general solutions, you can have a look at things like argus, bro-ids, sancp or ntop that log all sorts of information based on traffic they sniff on an interface."}
{"doc_id": 65847, "author": "Rampant", "text": "Real VNC or VNC Viewer are the same client (aside from platform) as used on Windows PCs for decades. OS X is designed to work with VNC protocol out of the box. As an added bonus, Real VNC is available as a free iOS app. The only real concerns you should have in using it are security hardening, ie restricting access to specific IP addresses or users."}
{"doc_id": 360768, "author": "Marinos An", "text": "This is what works for me: 7z a zipped.zip ./rootDir/* It will create a zip archive with root: any files/directories inside rootDir. e.g zipped.zip: file1.txt otherdir/ file2.txt Hidden files: As correctly pointed on @Shiva Wus comment the above does not include hidden files. This is also the case for the rest of the answers (at least the ones which preserve directory structure). One solution is to explicitly add the hidden paths wildcard. # The command below will include all files and directories starting with a dot. 7z a zipped.zip ./rootDir/* ./rootDir/.[!.]* OR # Same as above in one argument 7z a zipped.zip ./rootDir/{*,.[!.]*} result: zipped.zip: file1.txt .hiddenfile1.txt .hiddendir/ file3.txt otherdir/ file2.txt"}
{"doc_id": 98625, "author": "webchun", "text": "First try to restart your mac, then run the Disk Utility app. It will re-calculate your HD available space and show the correct numbers on Finder immediately"}
{"doc_id": 164161, "author": "Louis Maddox", "text": "Just joined this StackExchange to show some appreciation for Jeremys answer above, and also add the few lines of JS I used to export the tabs list (since copying with the cursor isnt ideal!) As Jeremy said, select Remote devices under More tools on Chrome devtools ⋮ icon (top right of the panel): set up USB debugging on your phone (under Settings⇒Developer options, root not required) note that you must enable the Developer options menu, its hidden by default to protect users on my phone this required tapping multiple times on the build number under Settings⇒About Device once this is done, plug your USB in and allow MTP connection when the Chrome devtools remote device panel is open, the phone will then request to allow USB debugging you can opt to always trust the computer Now the device is connected, open a 2nd devtools view on the devtools view from which you selected Remote devices to be able to retrieve the list of tabs using JavaScript note that you must have devtools in pop-out mode (use the vertical ellipsis symbol in the top right of the panel) to be able to get this up, otherwise Command+Option+J(MAC) Ctrl+Shift+J(WINDOWS) will just close the first devtools panel. expand the list from the first few items to all tabs by clicking Show more to script against the list, use the following few lines of code [entered in the console of the 2nd devtools window] To export a list of all URLs open on Chrome for Android, I chose to just make the list into a markdown formatted text string and copy it to the clipboard let bookmarkList = Array.from(document.querySelectorAll(.widget>.vbox)) .map(e => e.shadowRoot) .map(e => e && e.querySelector(.device-page-list)) .find(e => e); let bookmarks = Array.from(bookmarkList.querySelectorAll(.vbox)) .map(e => `[${e.querySelector(.device-page-title).innerHTML}](${e.querySelector(x-link).innerHTML})`); copy(bookmarks.join(\\n)); You will then have a list on your clipboard looking like this: [How can I export the list of open Chrome tabs? - Android Enthusiasts Stack Exchange](https://android.stackexchange.com/questions/56635/how-can-i-export-the-list-of-open-chrome-tabs) [Get Started with Remote Debugging Android Devices | Tools for Web Developers | Google Developers](https://developers.google.com/web/tools/chrome-devtools/remote-debugging/) [How To Enable USB Debugging On Your Android Phone](https://www.groovypost.com/howto/mobile/how-to-enable-usb-debugging-android-phone/) [Configure On-Device Developer Options | Android Studio](https://developer.android.com/studio/debug/dev-options.html) ..."}
{"doc_id": 98634, "author": "Pokermike", "text": "My original solution (crossed out below) no longer works. Things that do work: If you have a Mac keyboard, press the Help key to toggle between insert and replace mode If you have a Windows keyboard, press the Insert (or Ins) key to toggle between insert and replace mode Restart Slack (quit and relaunch); refreshing no longer works I contacted Slack support and was told to use ⌘+R to do a quick refresh and reset the mode from overwrite to insert. From Slack support team: > Thanks for writing in about this! Weve seen this occur on Mac computers recently as well, and the good news is there is an easy way to switch! To reset the mode from overwrite to insert, this should be possible with a quick refresh using Cmd+R Explanation: This is because slack is using electron, which is essentially a wrapper around a browser to create a desktop app. Other web commands work like ⌘+[ and ⌘+] to traverse your browser history backward and forward, respectively."}
{"doc_id": 65872, "author": "eskatos", "text": "The best solution Ive found today (2017) is to use Homebrew and Cask to install osxfuse and sshfs: brew install --cask osxfuse brew install sshfs And then: sshfs username@hostname:/remote/directory/path /local/mount/point -ovolname=NAME It works! :-)"}
{"doc_id": 65875, "author": "SamWN", "text": "Unless youre using backtrack/kali for a specific task: NO. Treat the super user as you would a loaded gun: if you have an immediate need and intention to use it: OK. If you can solve your problem in any other manner, however (e.g. sudo), do that."}
{"doc_id": 33111, "author": "Steve", "text": "Take a look at the free and simple to use yEd, I believe this would fit about right for your 2 yr old question :)"}
{"doc_id": 98647, "author": "Willempie", "text": "For some reason the disk my Mac was booting from was the macOS Installer Disk, all I had to do: Hold down the option (-alt) key before the Apple logo shows. Then just select your Macintosh HD (or how you named the volume when you installed macOS). This weird boot thing happened after I ran an update on High Sierra. If this doesnt resolve the issue, you could try the chosen answer. It could be that your problem the problems on your Mac are worse. Then I would suggest to backup all your data in safe mode (or from a terminal in recovery mode) and do a clean install of macOS from a USB stick or from internet recovery."}
{"doc_id": 196959, "author": "jlliagre", "text": "If you run Solaris or a derivative, have a look at conntrack"}
{"doc_id": 33125, "author": "graup", "text": "For PDFs: At least on Mac OS X, the Adobe Reader application (version 10+) has this feature in its print dialog. Theres an option to print as poster, meaning 100% scale across multiple pages."}
{"doc_id": 357, "author": "Davide Gualano", "text": "Power keys: Ctrl+⏏: Are you sure you want to shut down your computer dialog message appears: Ctrl+⌘+⏏: restart the computer Ctrl+⌥+⌘-⏏: shut down the computer ⌘+⌥+⏏: puts the computer in sleep mode ⇧+Ctrl+⏏: puts the monitor in sleep mode"}
{"doc_id": 366, "author": "Fishtoaster", "text": "Open a Find Window (cmd-f) or do a spotlight search and select show all Hit the little + icon (to the right of the save button) Select File Type as a search criteria and select the correct one. Rerun the search. (Disclaimer, Im not on a Mac right now :( so my exact instructions might be a little off)."}
{"doc_id": 367, "author": "Am1rr3zA", "text": "Search by Kind One of the most useful ways to narrow down a search is by using the kind: keyword. This allows you to restrict your list of results to a certain file format. For instance, if you type time machine kind:pdf, Spotlight will pull up only PDF files containing the words time and machine. You can also limit your search to e-mail messages, music files, System Preferences, applications, and more. While the original Spotlight recognized only a limited number of file types, the Leopard version can look for files created by specific applications, as well as certain file formats. Searching for kind:mp3 or kind:tiff will find files in one of those formats, and searching for kind:pages or kind:powerpoint will show only documents created in one of those programs. For a list of useful keywords, see “My Kind of Keyword. But remember, for the keywords to work, you must have the appropriate categories enabled in Spotlight’s preferences. you can get more info here or here."}
{"doc_id": 295278, "author": "eli", "text": "For bash, basically: instead of using cd one can use pushd to change directories. With practical usage: the history of visited directories is saved (correctly: stacked) and one can switch between them: pushd /home; pushd /var; pushd log To see the stack use dirs and for easier navigation (to get the numbers of the stack-entries use: dirs -v Output: me@myhost:/home$ dirs -v 0 /home 1 /var 2 /tmp Now utilize these numbers with cd and ~ like: cd ~1 But these numbers are rearranged now and position 0 will change, so just pushd the directory to the top position twice (or use a dummy on position 0) like: me@myhost:/home$ dirs -v 0 /home 1 /home 2 /var 3 /tmp Now 1..3 will keep their position (To release the current directory from the stack/deleting it from history, use popd)"}
{"doc_id": 196982, "author": "txtechhelp", "text": "tcpdump allows you to see all IP traffic flowing to/from a specific interface with the ability to filter based on certain criteria. tcpdump is typically installed on most *nix systems by default, if not theres usually a port somewhere to grab it for your specific distro."}
{"doc_id": 65916, "author": "Mike Ciaraldi", "text": "Back around 1990 I was working on a project with a guy named Tom. We were using a SUN server running SunOS (a Unix derivative, predecessor to Solaris). This was back in the days before CD drives and flash drives, so if you messed up the OS on your hard drive there was no way to recover. Tom used to routinely log in as root. I told him that was a bad idea, but he did not listen. One day I heard him say Uh-oh. He had meant to type comething like this: mv something* . Unfortunately he left off the final dot, so the shell expanded all the file and directory names which matched this pattern. Then the mv command used whatever ended up as the final name in the list as the destination directory, and moved everything else into it. Also unfortunately, he was currently at the root directory, so basically the entire file system got moved into one of its subdirectories. I used up-arrow to bring back the previous command and saw what had happened. The first thing I then said was, Dont log off! Or you will never be able to log in again. No problem, right? We could just move everything back. We could, except that the mv command was not one of the built-in commands of the shell. Instead, it was an executable program, stored in one of the files which had been moved. Luckily, ls was a built-in command, so after using ls to confirm where the commands had moved to, I was able to find the mv command, invoke it with its full path name, and put things back where they were supposed to be. And then I told him, Tom, this is why it is a bad idea to routinely log in as root."}
{"doc_id": 33149, "author": "Vaibhav Bajpai", "text": "I use Alfred → The universal hotkey allows me to activate it using a keyboard."}
{"doc_id": 131458, "author": "pesche", "text": "ShootMe does work for me on the Galaxy Tab (2.2), even if I did not root it and the ShootMe page says, that it works only for rooted devices."}
{"doc_id": 33158, "author": "Galas", "text": "You can run sudo hostname Name-Of-My-Computer in Terminal to change the name."}
{"doc_id": 98701, "author": "Ariel Allon", "text": "Id recommend checking if fsck is holding your disk hostage upon connection. This was it for me. Running ps aux | grep fsck revealed: root 2587 7.3 0.1 4363584 21780 ?? U 10:56PM 2:22.54 /System/Library/Filesystems/exfat.fs/Contents/Resources/./fsck_exfat -y /dev/rdisk2s1 So the solution was a sudo kill -9 2587 (insert your PID instead of 2587) (or sudo pkill -f fsck). As soon as that ran, my Volume immediately mounted. Oh the irony of fsck being the problem..."}
{"doc_id": 65936, "author": "Theodore Murdock", "text": "According to an answer on a similar question, its possible to use a program called Karabiner to detect the Logitec Windows-specific keyboard events sent by the M560, and translate them to regular keyboard or mouse button events that tools such as BetterTouchTool can pick up on. Please see the original answer on the duplicate question for full details, including a Karabiner configuration file for the M560."}
{"doc_id": 65941, "author": "nohillside", "text": "GNU grep is not part of coreutils. To install, run brew install grep As with coreutils, this doesnt automatically replace the existing grep ==> Caveats All commands have been installed with the prefix g. If you need to use these commands with their normal names, you can add a gnubin directory to your PATH from your bashrc like: PATH=/usr/local/opt/grep/libexec/gnubin:$PATH So after installing you can either use ggrep, gegrep and gfgrep; or extend PATH as shown above to use grep etc. The second option may confuse some macOS specific scripts though in case the options differ."}
{"doc_id": 408, "author": "Nippysaurus", "text": "All of the shortcuts are my favorite! Specifically (based on frequency of use) ⌘+H: Hide application"}
{"doc_id": 65946, "author": "Ajax", "text": "option + command + i is the winner"}
{"doc_id": 415, "author": "Artem Pakk", "text": "Starting from iOS4, while listening to music in iPod app the screen turns on for a second to show what song is currently playing. It wont happen if the iPhone is in your pocket."}
{"doc_id": 418, "author": "Martin Marconcini", "text": "You should take a look at mount’s help: man mount Upon closer inspection you’ll see that the filesystem’s type is: mount -t smbfs //username:password@MACHINENAME/SHARENAME /SomeLocalFolderOfChoice Password (and theoretically username) are optional. The result of the above command will be no output (if all went ok), but a cd /SomeLocalFolderOfChoice, should produce the remote results. Please note that SomeLocalFolderofChoice must exist. You can also use mount_smbfs to replace the mount -t smbfs."}
{"doc_id": 419, "author": "Studer", "text": "You could easily achieve this using mount_smbfs (which is, actually, a wrapper for mount -t smbfs) : mount_smbfs //user@SERVER/folder ./mntpoint Optionally, add the workgroup : mount_smbfs -W workgroup //user@SERVER/folder ./mntpoint You could, of course, change the ./mntpoint (for something like /Volumes/smb). After doing this, simply go to ./mntpoint to browse your data. To unmount, using the following command : umount ./mntpoint"}
{"doc_id": 131498, "author": null, "text": "You can use Javascripts alert method to return the source code, type this in the address bar: javascript: alert(document.getElementsByTagName(html)[0].innerHTML);"}
{"doc_id": 262574, "author": "Evgeny Vereshchagin", "text": "systemctl restart systemd-journald You can lose your logs: see https://github.com/systemd/systemd/issues/2236 mkdir /var/log/journal There is a change in v208: systemd-journald will no longer adjust the group of journal files it creates to the systemd-journal group. Instead we rely on the journal directory to be owned by the systemd-journal group, and its setgid bit set, so that the kernel file system layer will automatically enforce that journal files inherit this group assignment. A tmpfiles.d(5) snippet included in systemd will make sure the setgid bit and group are properly set on the journal directory if it exists on every boot. So, you should run something like systemd-tmpfiles --create --prefix /var/log/journal after mkdir /var/log/journal See also: Bug: users from the group systemd-journal couldnt read some journal files"}
{"doc_id": 65966, "author": "Gordon Davisson", "text": "First: the name rootless is misleading, since theres still a root account, and you can still access it (the official name, System Integrity Protection, is more accurate). What it really does is limit the power of the root account, so that even if you become root, you dont have full control over the system. Essentially, the idea is that its too easy for malware to get root access (e.g. by presenting an auth dialog to the user, which will cause the user to reflexively enter the admin password). SIP adds another layer of protection, which malware cant penetrate even if it gets root. The bad part of this, of course, it that it must also apply to things youre doing intentionally. But the restrictions it places on root arent that bad; they dont prevent most normal system customization. Heres what it restricts, even from root: You cant modify anything in /System, /bin, /sbin, or /usr (except /usr/local); or any of the built-in apps and utilities. Only Installer and software update can modify these areas, and even they only do it when installing Apple-signed packages. But since normal OS X-style customizations go in /Library (or ~/Library, or /Applications), and unix-style customizations (e.g. Homebrew) go in /usr/local (or sometimes /etc or /opt), this shouldnt be a big deal. It also prevents block-level writes to the startup disk, so you cant bypass it that way. The full list of restricted directories (and exceptions like /usr/local and a few others) is in /System/Library/Sandbox/rootless.conf. Of course, this file is itself in a restricted area. When you upgrade to El Capitan, it moves any unauthorized files from restricted areas to /Library/SystemMigration/History/Migration-(some UUID)/QuarantineRoot/. You cant attach to system processes (e.g. those running from those system locations) for things like debugging (or changing what dynamic libraries they load, or some other things). Again, not too much of a big deal; developers can still debug their own programs. This does block some significant things like injecting code into the built-in Apple apps (notably the Finder). It also means that dtrace-based tools for system monitoring (e.g. opensnoop) will not be able to monitor & report on many system processes. You cant load kernel extensions (kexts) unless theyre properly signed (i.e. by Apple or an Apple-approved developer). Note that this replaces the old system for enforcing kext signing (and the old ways of bypassing it). But since v10.10.4 Apple has had a way to enable trim support for third-party SSDs, the #1 reason to use unsigned kexts has gone away. Starting in Sierra (10.12), some launchd configuration settings cannot be changed (for example, some launch daemons cannot be unloaded). Starting in Mojave (10.14), access to users personal information (email, contacts, etc) is restricted to apps that the user has approved to access that info. This is generally considered a separate feature (called Personal Information Protection, or TCC), but its based on SIP and disabling SIP disables it as well. See: What and how does macOS Mojave implement to restrict applications access to personal data? Starting in Catalina (10.15), protection of most system files is strengthened by storing them on a separate read-only volume. This is not strictly part of SIP, and is not disabled by disabling SIP. See: WWDC presentation on Whats New in Apple [Catalina] File Systems and Whats /System/Volumes/Data?. Starting in Big Sur (11.x), the read-only system volume is now a Sealed System Volume (a mounted snapshot rather than a regular volume), so making changes to it is even more complicated. See: the Eclectic Light Company article Big Sur boot volume layout. If you dont want these restrictions -- either because you want to modify your system beyond what this allows, or because youre developing & debugging something like kexts that arent practical under these restrictions, you can turn SIP off. Currently this requires rebooting into recovery mode and running the command csrutil disable (and you can similarly re-enable it with csrutil enable). Modifying the system volume in Catalina requires disabling SIP, then mounting the volume with write access (and then rebooting and turning SIP back on is recommended). In Big Sur, additional steps are required to disable authentication of the system volume before changes, and afterward create a new snapshot. You can also selectively disable parts of SIP. For example, csrutil enable --without kext will disable SIPs kernel extension restriction, but leave its other protections in place. But please stop and think before disabling SIP, even temporarily or partially: do you really need to disable it, or is there a better (SIP-compliant) way to do what you want? Do you really need to modify something in /System/Library or /bin or whatever, or could it go in a better place like /Library or /usr/local/bin etc? SIP may feel constraining if you arent used to it, and there are some legitimate reasons to disable it, but a lot of what it enforces it really just best practice anyway. To underscore the importance of leaving as much of SIP enabled as much of the time as possible, consider the events of September 23, 2019. Google released an update to Chrome that tried to replace the symbolic link from /var to /private/var. On most systems, SIP blocked this and there were no bad effects. On systems with SIP disabled, it rendered macOS broken and unbootable. The most common reason for disabling SIP was to load unapproved (/improperly signed) kernel extensions (specifically video drivers); if theyd only disabled the kext restriction, they would not have been affected. See the official Google support thread, a superuser Q&A on it, and an Ars Technica article. References and further info: WWDC presentation on Security and Your Apps, a good explanation by Eldad Eilam on quora.com, the Ars Technica review of El Capitan, and an Apple support article on SIP, and a deep dive by Rich Trouton (who also posted an answer to this question)."}
{"doc_id": 131504, "author": "Lie Ryan", "text": "This depends on the screen technology. For instance, (it was said that) Android 2.3 Gingerbread has dark theme since Googles latest flagship device Nexus S uses (Super) AMOLED display which consumes less energy when displaying dark color since AMOLED produces its own light and darker color emits less photons. Contrasts with LCD display which uses a backlight (a fixed number of photons) and the LCD crystals filters those colors it needs. The crystals on an LCD displays though, actually consume slightly less power when displaying white since it takes more power to strain the crystal to block more light. Screen color does not affect the backlighting. There are certain display technologies in TVs that tries to give dynamic backlighting by dimming the screen when displaying darker image. Im not aware of any device that actually ships with that type of screen though."}
{"doc_id": 131505, "author": "Matt", "text": "On OLED, AMOLED and Super AMOLED screens: Yes LCD screens: No"}
{"doc_id": 33210, "author": "user41486", "text": "Try this one. I used it to find lost hidden account. dscl . list /Users | grep -v ^_"}
{"doc_id": 65979, "author": "Mazzieh71", "text": "You can delete them through FileZilla or similar files manager."}
{"doc_id": 33212, "author": "nohillside", "text": "OmniGroup offers a free utility called OmniDisksweeper which lists files/folders sorted by size. OmniDiskSweeper is really great at what it does: showing you the files on your drive, in descending order by size, and letting you delete them easily! It scans your disks as quickly as possible and shows you the facts — if a file doesnt make the cut to stay, just click the big Delete button and be done with it. Its a fast, easy way to find those large files cluttering up your drive and clearing them out for new, better things. Make sure you want them gone, though. Theres no going back"}
{"doc_id": 131521, "author": "Keith Twombley", "text": "Look for an app called View Web Source in the market and install it. Then when browsing, open your menu and tap share, in the list that pops up choose View Web Source."}
{"doc_id": 65998, "author": "Zweedeend", "text": "In the Mail app, go to Window > Activity and try to cancel everything it is doing. That solved it for me"}
{"doc_id": 98778, "author": "Milkmannetje", "text": "Allright, just confirmed that this product is not fully compatible with a MacBook. The dock doesnt communicate powerinfo with the Macbook so doesnt supply it with enough power. (Charging takes more than 10 hours.) Other peripherals do work. USB: Works Ethernet: Works Display: VGA/Displayport/HDMI Works"}
{"doc_id": 33245, "author": "P.K.", "text": "Assuming that each picture you shoot is 1 MB, 20000 pictures will take up 20000 MB which is approximately 20 GB. Now if you put these on your iPad 2, you have around 40 GB to work with keeping the reserved space in mind, which is okay. Looking at that information, you can upload 40000 more if you need. An alternative is to upload them all on a photo-hosting website to save all the 20 GB if you dont look at them often. Responding to your second query, yes: it is quite responsive. My uncle has 8436 pictures and 129 videos on his iPad 2 and it is working perfectly."}
{"doc_id": 66015, "author": "JD Leonard", "text": "Take screenshot. Paste screenshot into Evernote. Copy screenshot from Evernote. Paste screenshot where intended."}
{"doc_id": 131553, "author": "Steve Mould", "text": "Hey, I just ran a load of test to figure this out. They are vaguely scientific tests! I figured out that I was saving 20% battery by switching to dark wallpaper and dark themed apps. Have a look through my write up, you should be able to work out the saving on your phone: http://blog.stevemould.com/phone-battery-save-black-wallpaper/"}
{"doc_id": 360932, "author": "Vishal Sahu", "text": "I generally use `command` to place its output as argument to another command. For e.g., to find resource consumed by process foo on freebsd will be: procstat -r `pgrep -x foo` Here, pgrep is used to extract the PID of process foo which is passed to procstat command which expects PID of process as argument."}
{"doc_id": 393708, "author": "Stephen C", "text": "The cardinal rules are: Follow the projects existing coding standard. If there is no coding standard and you are editing an existing code-base owned by someone else - be consistent with the style of the existing code, no matter how much you like / dislike it. If you are working on a green-field project - discuss with other team members, and come to a consensus on a formal or informal coding standard. If you are working on a green-field project as the sole developer - make up your own mind, and then be ruthlessly consistent. Even if you have no external constraints on you, it is (IMO) best to look for an existing (widely used) coding standard or style guideline, and try and follow that. If you roll your own style, theres a good chance that you will come to regret it in a few years. Finally, a style that is implemented / implementable using existing style checkers and code formatters is better than one that needs to be enforced manually."}
{"doc_id": 492012, "author": "Hexodus", "text": "The PHP-Documentation clearly says that you can use short echo tags safely: 5.4.0 The tag <?= is always available regardless of the short_open_tag ini setting. Although this is for PHP version 5.4 and greater but everybody should at least use this one. I would prefer them for templating purposes only."}
{"doc_id": 66044, "author": "Nicolas Guérinet", "text": "You need to reset your SMC. Just like another answer i dont have the why but i have the solution. Mac mini, iMac, Mac Pro Shut down your Mac, unplug the power chord, wait for 30 seconds, plug the power cord, wait for 5 seconds, start your Mac. MacBook Shut down your Mac, press Shift+Ctrl+Alt first and then press the power button. It should not start. Take a look at the LED from your power cord and it should just change for few seconds. Then, release the Shift+Ctrl+Alt and start your Mac."}
{"doc_id": 295422, "author": "L.R.", "text": "getconf _NPROCESSORS_ONLN (getconf is part of glibc)"}
{"doc_id": 590338, "author": "OscarAkaElvis", "text": "That means the owner of the page hired Cloudflare services to protect his/her page against DoS attacks. Is some kind of intermediate page which check the connection and then redirect and show you the final page if the check is passed. They check the origin (IP) of the connection, the kind of packet, the size of the packet, the number of packets received (rate), the user agent of the browser, etc... is how they meassure if the connection is legitime or not to pass the filter or not."}
{"doc_id": 590339, "author": "WhiteWinterWolf", "text": "Most Denial-Of-Service (DOS) attacks rely on some asymmetry between the resources involved on attacker side and on target side. In other words, to be successful, a DOS needs an action to require very few resources client-side (so the each clients can send a lot of requests) while involving larger resources server-side (so the server(s) will be unable to handle the load). Due to this, DDOS attacks (the Distributed version of DOS attacks) are obviously not engaged by real humans clicking on links in a browser tab, but by bots sending massive amount of parallel requests to the target. The consequence of this is that the DDOS client is not a real browser, but a tool which may more-or-less simulate one. Cloudflare DDOS protection system is quickly described on their website as follow: an interstitial page is presented to your site’s visitors for 5 seconds while the checks are completed. Two things trigger my attention here: The checks: the most obvious way to sort real website users from automatic DDOS bots is to check whether the HTTP client is a real browser or not. This can go through testing the clients behavior against a panel of tests (see the post bot detection via browser fingerprinting for instance) and compare the result with the one expected from a genuine instance of the browser the client claims to be (for instance if the client claims to be a Firefox version 52 running on a Windows 10 machine, does it present the same characteristics?). 5 seconds: Executing JavaScript tests and redirecting the visitor could be a very fast and almost transparent operation, so I believe that this 5 seconds timeout is not there by accident but is meant to revert the computational asymmetry back in favor of the server. The most light version of such principle would simply be to ask the client to wait (sleep) 5 seconds before resubmitting the same request (with a unique identifier stored in a cookie, as described on Cloudflare page). This would force the DDOS client to somehow handle a queue of pending redirections, and would finally make the overall DDOS process less effective. A more brutal alternative would be to request the browser to solve some mathematical challenge which would require a few seconds to be solved on an average home system. In such a case, attackers would have no other choice than spend computational power to solve these challenges if they would like to proceed, but doing so will completely void the asymmetry since all the attackers resource will be busy in solving challenges instead of sending requests, finally DOSing the attackers system instead of the targets one."}
{"doc_id": 131593, "author": "Doliveras", "text": "Charging from a USB port of a computer is slower than charging using a charger because the voltage and amperage provided by the computer is considerably lower than in the case of using a normal charger, so the mobile is using “slow charge mode I don’t know which is the charging speed ration between USB and normal charger in the case of a SGS, but in my case (HTC Desire) with a normal charger I need approximately 2 to 3 hours for a full charge, but with a USB connection that time only charges 15 to 35 percent."}
{"doc_id": 131594, "author": "jmbouffard", "text": "A computer USB port is limited to 500 milliamperes (or 900 mA for a USB 3.0 port). The dedicated wall charger, on the other hand, is usually able to provide 1000 mA or more. Lets take the case where a connected phone uses 200 mA. Then, the USB port would have 300 mA left to charge the battery while the wall USB charger would have 800 mA left. A typical smart phone battery has a capacity of about 1500 mAh (milliamperes-hour) nowadays. This means that in a perfectly efficient world, a current of 1500 mA would charge the battery in 1 hour. So the same battery would then charge in 5 hours over the USB 2.0 port and in about 1h50 with the wall charger. Of course in reality power losses would also affect charging times but these numbers are quite close to what I get with my actual phone."}
{"doc_id": 164368, "author": "vholten", "text": "Added March 2019: the Account Key Backup seems to have been removed from Messenger, so I have updated this answer. According to a Messenger help page, In order to switch to a different account or access your account on another device, youll need to add a password. To add a password to your account: From Chats, tap your profile picture in the top left corner. Scroll down and tap Password. Tap to enter a password and tap OK. You should now have a password associated with your account and can Switch Account The Messenger help page currently states This feature is not currently available for Android but it is present in the Android app. Old solution: (cannot be used anymore) To transfer Facebook Messenger conversations to a new phone without a Facebook account, while keeping the same phone number, do the following. On the old phone, open Messenger and tap your profile picture to go to your profile settings. Tap Account Key Backup. Select the option to back up your account key to Google Drive. After the backup has been made, Messenger will say Account Key Backed Up - Your account key is saved to Google Drive with the email address ***. Youll be able to sign into Messenger if you switch phones or uninstall the app. On the new phone, install Messenger, and open it. Select the option I do not have a Facebook account, and enter your phone number. You will receive an SMS with a verification code to enter in Messenger. Messenger will ask you if you want to continue with your existing account; answer yes. Messenger will tell you that an account key has been found on Google Drive and use it to copy your conversations. However, secret conversations wont be copied. You will be logged out of Messenger on the old phone, and will no longer be able to use Messenger there."}
{"doc_id": 229908, "author": "Caleb", "text": "You dont typically clear the journal yourself. That is managed by systemd itself and old logs are rotated out as new data comes in. The correct thing to do would be to schedule journald to only keep as much data as you are interested in. The most usual thing to adjust is the total disk space it is allowed to take up. Once it crosses this boundry it will start pitching old entries to stay near this value. You can set this in /etc/systemd/journald.conf like so: SystemMaxUse=100M"}
{"doc_id": 590368, "author": "user2394284", "text": "Just to add what I know from experience: Cloudflare blocks non-graphical browsers (tested: links, lynx), not on the first page view, but from the second one. These browsers (presumably) dont load images, at least does not show them, and they dont support javascript either. How do I know? Being stuck with a broken graphical environment & searching the web for answers…"}
{"doc_id": 262689, "author": "Juancho", "text": "You can use fpm with the --after-install option to replace the postinst script, like this: fpm -e --after-install ../DEBIAN/postinst.new -s deb -t deb ../old.deb"}
{"doc_id": 590374, "author": "Trey Blalock", "text": "Deep Packet Inspection, also known as complete packet inspection, simply means they are analyzing all of your traffic as opposed to just grabbing connection information such as what IPs you are connecting to, what port number, what protocol and possibly a few other details about the network connection. This is normally discussed in contrast to the gathering of NetFlow information which mainly collects the information listed above. Deep packet inspection gives your provider a lot of information about your connections and habits of Internet usage. In some cases, the full content of things like SMTP e-mails will be captured. HTTPS does encrypt the connections but your browser has to make DNS requests which are sent primarily via UDP so that data will be collected as will any unencrypted links or unencrypted cookies sent incorrectly without https. These additional bits which will be collected may be very telling about what type of content you are looking at. The larger concern for most people is about data aggregation, by collecting this information a data scientist could create a fingerprint for your Internet usage and later associate with past activities or activities from other locations (when you are at work or are on vacation). Likewise, your service provider may choose to sell this to any number of organizations (possibly including criminal organizations) where it could then be used against you in ways. In many countries, people have an expectation that their communications are considered to be private and collecting this data very much goes against that privacy expectation. Another interesting aspect of this is in the cases like the US where this data may soon be sold it allows International communications sent to people, or servers, in the US be sold as well. Likewise, this could potentially allow every agency from local law-enforcement, military, tax authorities, immigration authorities, politicians, etc. a way to bypass long-standing laws which have prevented them from accessing this type of information, or important informational subsets within this data otherwise. A slightly different concern when this data can be sold is competitive intelligence / corporate espionage. In the scenario where a company does a lot of research-intensive work at their headquarters located in some small geographical location (think of pharmaceuticals or a defense contractor) selling that data makes it possible for anyone to buy all of the traffic from the local ISP where most of those researchers live and analyze what they are looking for when at home, possibly even directly from the ISP hosting the traffic for their corporate headquarters. If other countries arent selling similar data it gives foreign companies and companies wise enough to try and buy this data a huge technical advantage. Likewise, it would also allow foreign governments to buy ISP traffic which includes the data from US (or other government) Officials homes. Imagine companies monitoring their employees behavior at home or on their mobile devices. This will likely have a chilling effect on activists and whistle-blowers as well. Likewise, if credit cards or PII are sent in the clear to a poorly secured remote site your ISPs data set now has a potential PCI or PII regulatory issue on their hands. So this amplifies data-leakage problems of all types by making additional copies of the data leaked. With the examples Ive just mentioned above, and there are hundreds of others, it should be easy to see why this type of data collection has a different level of importance to it than just metadata or basic connection information. Even if your ISP never sells this data they are collecting quite an interesting dataset. Its a security issue that definitely has a lot of potential long-term security implications."}
{"doc_id": 590375, "author": "MiaoHatola", "text": "Trey Blalocks answer describes percisely what deep packet inspection (DPI) is. But Id like to add three things to hopefully answer your specific questions: There is a technique of DPI that does decrypt your data, called SSL interception, although it is more common in enterprise situations and only possible if the ISP (or any other interceptor) has the ability to install a certificate on your machine. So unless the ISP had some way of doing that (technician etc.) this is probably off the table. HTTPS would prevent the ISP from being able to read data. Of course, This is only true for services that use HTTPS (which unfortunately is not all of them). Also you need to consider that the ISP can read metadata whether the connection is encrypted or not. A VPN would protect you against DPI performed by the ISP (not by the VPN provider). This is thanks to the fact that VPNs use an encrypted tunnel to connect you to the exit node. This encrypts all of your traffic, and all of the metadata will show packets leaving your computer and going to the VPN server (thus not disclosing the actual server you are accessing)."}
{"doc_id": 98856, "author": "jbwharris", "text": "I had this problem installing the latest macOS update. I tried a few things, but in the end the resolution was pretty easy. Boot up your Mac using Cmd + R to access the recovery partition In the Apple menu choose Startup Disk Select your HD and I believe there was a button to unlock the drive. Input your password and the drive will be unlocked. Reboot your Mac and it should boot right up I know @Clonemans solution was essentially the same idea, but this ended up being a little more straightforward as I wasnt able to get the menu to show up in the upgrade error screen."}
{"doc_id": 426543, "author": "Šimon Tóth", "text": "AGPL is the same as GPL; therefore if your app is using AGPL code it has to be AGPL licensed. What AGPL does on top of GPL is the redefinition of user. For GPL programs running on your server, you are the user, for AGPL, the real users of the app are the users of your website or service. Therefore you are distributing the app if someone other than you is using it. And that of course implies all the standard GPL requirements. As for Mongo, Im assuming that apps using it dont use its code, only some API, which isnt AGPL licensed."}
{"doc_id": 197167, "author": "derobert", "text": "You can just use *; there is no need for *.*. File extensions are not special on Unix. * matches zero or more characters—including a dot. So it matches foo.png, because thats zero or more characters (seven, to be exact). Note that * by default doesnt match files beginning with a dot (neither does *.*). This is often what you want. If not, in bash, if you shopt -s dotglob it will (but will still exclude . and ..). Other shells have different ways (or none at all) of including dotfiles. Alternatively, zip also has a -r (recursive) option to do entire directory trees at once (and not have to worry about the dotfile problem): zip -r myfiles.zip mydir where mydir is the directory containing your files. Note that the produced zip will contain the directory structure as well as the files. As peterph points out in his comment, this is usually seen as a good thing: extracting the zip will neatly store all the extracted files in one subdirectory. You can also tell zip to not store the paths with the -j/--junk-paths option. The zip command comes with documentation telling you about all of its (many) options; type man zip to see that documentation. This isnt unique to zip; you can get documentation for most commands this way."}
{"doc_id": 590385, "author": "MikeP", "text": "As stated by Trey, DPI can see the entire content of your network traffic. All of it. If it is plain text, then they see everything that you do. To add on to Miaos answer: Things DPI can see, even when you use HTTPS: DNS information, e.g. https://catvideos.com/tigers - they will see https://catvideos.com IP address connectivity. So, even you you HTTPS to that site with cat videos, they can see that you connected to that cat video site and downloaded 500 GB of data. They dont know what data, but they know the DNS name, and the IP address, and amount of data to that site, and to every site. Ads. Many/most Ad networks do not use HTTPS, so that data is not always encrypted. This can result in a mixed encryption or similar warning from a browser. other data: Many sites using HTTPS for login will then drop the encryption for everything else. graphics: many sites wont encrypt things like their logo or various graphic or video files. They may encrypt your login and search, but not results. other non-HTTPS traffic like UDP, mail, SNMP, ftp, telnet, updates to some software might not use HTTPS, etc. With a VPN, they will still see 100% of the data. However, other than the connection to the VPN provider, theyll only see encrypted data. They will know that you downloaded 800GB from VPNco.com, but will know nothing of the data inside. Even things that are not encrypted via protocol will get encrypted since a lower level is encrypting. Now, the VPNco.com will then see your data. With the (potential) change in US law about ISP and data privacy, combined with the (potential) loss of net neutrality, ISPs might be able to not only see 100% of your data, they could modify that data, slow or block sites they want, and might be able to sell any/all of your data to a 3rd party (as Trey states). Im not covering MITM (like Miao states in #1 above), since you stated ISP, I assume that you are talking about a home system and a DSL or cable modem. https://stackoverflow.com/questions/499591/are-https-urls-encrypted"}
{"doc_id": 426555, "author": "Mark H", "text": "The AGPL is based on the GPL, not the LGPL. It does not contain any linking exceptions, and any work using AGPL code (linked or otherwise, modified or not) must also be AGPL licensed and distributed. Using separate processes can circumvent the (A)GPL, but this is murky ground. If your end application depends on the external process, such that it wouldnt function properly without it, then it would be considered a derived work of the AGPL software. In most cases where people use separate GPL applications in closed source programs, they provide the GPL work as an optional extension, or an alternative back-end to some other piece of code etc. The (A)GPL work cannot be distributed alongside the final application even as a separate app (eg, putting them into the same archive or repository), although its fine to provide instructions on where to find the GPL work and how to use it with your app."}
{"doc_id": 66125, "author": "Tetsujin", "text": "UK Keyboard [see below for other languages] Cmd ⌘ ` Cmd ⌘ Shift ⇧ ` to go the other way. Left of z on a UK keyboard [non-shifted ~ ] Note: This only works if all windows are in the same Space, not if they are spread over multiple Spaces, which includes fullscreen. To overcome this, use Cmd ⌘Tab as usual and on the icon of the application you want to switch windows in press the down arrow key (with Cmd ⌘ still pressed). Then use left/right keys to navigate to the desired window across spaces and desktops. You can also achieve this by clicking the apps icon in the Dock - this method will also switch to fullscreen windows, which the other methods will not.. From comments - You can check which key command it is for your language by switching to Finder, then look at the Window menu for Cycle through windows... BTW, specifically in Chrome, Safari & Firefox, but no other app I know of on Mac, Cmd ⌘ (number) will select individual tabs on the frontmost window. It also would appear that Cmd ⌘ ` is yet another of those language-specific shortcuts; so if anyone finds any more variants, please specify for which language & keyboard type. Unfortunately, as of July 2021, Apple has changed this page, making it useless for our purposes:/ If anybody finds new combos for different languages, please check Keyboard layout here - Apple KB: How to identify keyboard localizations - & add that as well as which Input Source you use in System Prefs > Keyboard > Input Sources. Add a keyboard picture from the KB page too, if that would help. That will make it easier for future Googlers. Further info: You can change the keys in System Prefs > Keyboard > Shortcuts > Keyboard... though it doesnt list the reverse direction, it does still work when you add shift to that new combo. I tested by moving mine from ` (and ~ ) to § (and ± ) You can use the alternative of Ctrl ⌃ F4 [visible in the prefs window above] but that almost indiscriminately marches through every single open window on all Spaces, without switching to the correct Space each time. Its really not too useful unless you use a single Space, just included here for completeness."}
{"doc_id": 66126, "author": "Matthieu Riegler", "text": "Command+` is the way to go on OS X to change between windows of the same application."}
{"doc_id": 164431, "author": "Jonathan", "text": "How to Speed up Slow Android Remember the day you bought your android? It wasnt slow. It was so fast. What happened? Did the silicon get slower? Did the bits get clogged? Of course not. Youre just running more invisible background services. First, disable auto updates in Samsung galaxy store (if applicable), in settings > software updates, In secret developer options menu (look it up) and Google play store This is important because otherwise they just reinstall / update themselves. Then look for apps that open automatically after removing them from via device maintenance > clear memory & developer options > running services and uninstall or reset them to factory default to as many as you can (I also remove permissions from them so they cant read from storage secretly in the background etc.). Some system apps you may want to keep, such as Google play services etc. Just uninstall the ones you are confident you understand are not needed Remember, clearing the memory does NOT speed up the device, it only shows you what apps autoload background processes so you can uninstall them. A good example of this is Instagram, if you notice it keeps running while its closed, because it will preload dozens of Instagram videos in your feed before you even open the app. While preloading is generally seen as an optimization, if you have enough apps aggressively preloading at the same time, and security apps monitoring those apps, and RAM filling up which then kicks off garbage collection on the Java runtime, and possibly even memory paging, plus any activity you actually request, plus reporting your location to Google, plus reporting your location to find your phone programs, plus checking traffic on your future commute, plus parsing your calendar for AI usage with Google Home, plus updates checking, plus notification querying, etc etc, then you may find that your device is doing far more activity than it can handle. Simple way to test this is to turn on Max Battery Saving option and see if the battery and responsiveness improves. If so, its in large part because all the extensive background processing is disallowed. Also remember that disabling auto updates does not speed up the phone per se, it just allows you prevent future updates from causing unexpected performance degradation. It makes you the gatekeeper so your phone cannot magically slow down overtime, but rather lets you pick and choose what apps you trust to update (and of course, update the apps you love.) Its like Kon Mari method for your phone. Remember, phones dont get slow over time. Bad programming in Updates cause phones to get slow. And this will get you back to a smooth android like the day you bought it (also good for battery) Ive had outstanding success with this. And my frame rate is 2x better as well as app open speed. Its fantastic. Oh and also enable background ANRs so you can see invisible stalls"}
{"doc_id": 197203, "author": "Gert van den Berg", "text": "Another way would be to use find and xargs: (this might include a . directory in the zip, but it should still extract correctly. With my test, zip stripped the dot before compression) find . -type f -exec zip zipfile.zip {} + (The + can be replaced with \\; if your version of find does not support the + end for exec. It will be slower though...) This will by default include all sub-directories. On GNU find -maxdepth can prevent that."}
{"doc_id": 33391, "author": "Christian Long", "text": "This article from Lifehacker.com.au suggests setting the Dock autohide delay to 1000 seconds, like so: defaults write com.apple.dock autohide-delay -float 1000; killall Dock To restore the default behavior: defaults delete com.apple.dock autohide-delay; killall Dock The author says he sets the delay to two seconds, so he can still get to the Dock in those rare cases when its needed."}
{"doc_id": 637, "author": "Kyle Cronin", "text": "Your ringer volume adjusts the volume of the sound coming out of the phone when its ringing. If the phone is not playing media (i.e. no sound is coming out of it) then the volume buttons on the side adjust the ringer volume. If you are playing media (music, video, etc) out the internal speakers, then the buttons on the side adjust the volume of that media coming out those speakers. Finally, when you have headphones plugged in, the iPhone knows this and has a separate volume for headphones. Using the volume buttons will adjust the headphones volume when headphones are plugged in. The reason why these are separate is because sometimes you want to mute your ringer, but still want to listen to media (or vice versa), and because the headphone and internal speaker volumes are different and need to be adjusted separately."}
{"doc_id": 164478, "author": "GorvGoyl", "text": "Ill share 4 methods to play youtube in background and with the screen lock. Install Brave browser, enable media play background option in site settings, and visit https://m.youtube.com use Youtube vanced app https://youtubevanced.com/ use YMusic app use NewPipe app"}
{"doc_id": 230024, "author": "jgr", "text": "Identify stream numbers: $ ffmpeg -i in.mp4 ... Stream #0:0: Video: ... Stream #0:1: Audio: ... Stream #0:2: Audio: ... Use -map _file_:_stream_ to select which streams to process and output $ ffmpeg -i in.mp4 -map 0:0 -map 0:2 -vcodec copy -acodec copy out.mp4 see: https://ffmpeg.org/ffmpeg.html#Advanced-options"}
{"doc_id": 33425, "author": "xander", "text": "I have found the answers to this question helpful for this as well. For an easy way to invoke App Expose to get at minimized windows for current app use Cmd-Down; Down; Enter."}
{"doc_id": 262804, "author": "chaos", "text": "Systemd is backward compatible with SysV init scripts. According to LSB 3.1, the init script must have informational Comment Conventions, defining when the script has to start/stop and what is required for the script to start/stop. This is an example: ### BEGIN INIT INFO # Provides: my-service # Required-Start: $local_fs $network $remote_fs # Required-Stop: $local_fs $network $remote_fs # Default-Start: 2 3 4 5 # Default-Stop: 0 1 6 # Short-Description: start and stop service my-service # Description: my-service blah blah ... ### END INIT INFO This is a commented section which is ignored by SysV. On the other hand, systemd reads that dependency information and runs those scripts depending on that. But there is one point, where systemd and SysV differ in terms of init scripts. SysV executes the scripts in sequential order based on their number in the filename. Systemd doesnt. If dependencies are met, systemd runs the scripts immediately, without honoring the numbering of the script names. Some of them will most probably fail because of the ordering. There are a lots of other incompatibilities that should be considered. If there are init scripts and .service files for the same service, systemd will execute both, as soon as the dependencies are met (in case of the init script, those defined in the LSB header)."}
{"doc_id": 98966, "author": "Sergii Ivashchenko", "text": "Just hold the Option key while taking a window screen shot."}
{"doc_id": 328349, "author": "ness-EE", "text": "Create (or edit if it exists) the following ~/.ssh/config file: Host * UseKeychain yes AddKeysToAgent yes IdentityFile ~/.ssh/id_rsa"}
{"doc_id": 131744, "author": "Bryan Denny", "text": "Another possible cause: is your phones memory full? If your phone is low on free memory, it will not sync any new data to it. Youll have to uninstall some apps or move them to the SD card to resolve this."}
{"doc_id": 131749, "author": "Stefano", "text": "There are actually several alternatives to the official Google Android market (aka Play Store). I personally like to search for new apps from my PC browser, and a bit less from my phone. Most (all?) of the markets nowadays offer both, via a dedicated phone-app that youll have to install, except from the official one which is already there. Until, well, yesterday, the official market would not have been available from your PC (meaning: on a PC web browser). Now it is, with a neat push-to-your-phone one click installation that is taking away one of the advantages of the competition (see AppBrain). The alternative markets, though, have still their peculiarities. Ill make a short summary but dont expect it to highlight all of the differences. Some markets (e.g. AndSpot) do not offer very specific features to users, but try to gather developers by offering advanced features such as easy stats. Amazon AppStore: latest big entry. countries limitations; catalog looking very promising with some (exclusive?) good pay-for apps; also features special offers and daily freebies. Def worth checking out AppBrain: born to let you install Android Market applications directly from your PC web browser, also allows you to discover new apps based on the ones you have. Its a meta-store (my favourite before the official market update) APKPure: dont need any registration to use it SlideME: they provide applications to niche markets, based on geographic location, payment method or even types of applications that users cant find in traditional channels Samsung Apps (must be installed on Samsung Galaxy devices, or else you cant use this): Samsung app store, which of course requires you to own a Samsung Android device F-Droid they distribute FOSS open source packages that pass audit and verification to ensure that code have no malicious parts. GetJar: my latest discovery. Quite a lot of apps, and they have specials (GOLD) commercial apps for free. Extremely interesting platform for developers, since they seem to offer above-the-average marketing and PS activities! TorrApk: its free and it distributes only free Android apps through their apk files. If you are a developer you can get your account and publish your apps. (NB. Not sure how legit the apps there are, though) appsfire: used to be yet another app for discovering official market applications (iOS/Android), now an app advertising agency Ill add that theres a market for Adult Apps too now; and a lot of review/forum sites will link to one or more of these markets, e.g., AndroidTapp or AndroidPit AndroLib. I suggest you click on some of these links and see for yourself if the look/applications suit your style! Thanks to various sources, in particular this thenextweb.com article, and a lot of other stackexchange editing! For neverending memory, the following are no longer available: AndSpot: focused around an app for sharing and discovering apps Handango by appia.com: a huge, cross-platform (Symbian/Android/Java/Winmobile...) market aproov: a quite different web look. Register to download via a specific phone app. MobiHand OnlyAndroid: more focused on (expensive) pay apps, but offers discounts and free deals"}
{"doc_id": 131750, "author": "jmbouffard", "text": "In Android, applications never need to be closed and the OS is taking care of cleaning the memory of any remaining applications when the resources are needed elsewhere. Using a task killer will just break the normal operation of the OS and could even slow down the device because the applications will always have to be reloaded from the start. Android application life cycle is working in a way that applications that are not on top are moved in a paused state that doesnt use any cpu anymore; only the memory content is kept in case the application is opened again; and the memory will be freed if needed. This being said, the application developer has the responsibility to follow the application life cycle when he creates his application so some bugs or mistakes can happen that will result in an application that never really stops or pause. If you encounter such application and what to close it you can do it through the Settings -> applications -> Manage applications by selecting Force stop on the application. But I would really not recommend using a task killer that is constantly running on the device."}
{"doc_id": 197285, "author": "Matt", "text": "Update As mikemaccana notes, the systemd journal is now the standard logging device for most distros. To view the stdout and stderr of a systemd unit use the journalctl command. sudo journalctl -u [unit] Original Answer By default stdout and stderr of a systemd unit are sent to syslog. If youre using the full systemd, this will be accesible via journalctl. On Fedora, it should be /var/log/messages but syslog will put it where your rules say. Due to the date of the post, and assuming most people that are exposed to systemd are via fedora, you were probably hit by the bug described here: https://bugzilla.redhat.com/show_bug.cgi?id=754938 It has a good explanation of how it all works too =) (This was a bug in selinux-policy that caused error messages to not be logged, and was fixed in selinux-policy-3.10.0-58.fc16)"}
{"doc_id": 262831, "author": "osvein", "text": "POSIX Base Specifications, Issue 7 on /tmp: The following directory shall exist on conforming systems and shall be used as described: /tmp A directory made available for applications that need a place to create temporary files. Applications shall be allowed to create files in this directory, but shall not assume that such files are preserved between invocations of the application. The File Hierarchy Standard 2.3 on /tmp: The /tmp directory must be made available for programs that require temporary files. Programs must not assume that any files or directories in /tmp are preserved between invocations of the program. Rationale IEEE standard P1003.2 (POSIX, part 2) makes requirements that are similar to the above section. Although data stored in /tmp may be deleted in a site-specific manner, it is recommended that files and directories located in /tmp be deleted whenever the system is booted. FHS added this recommendation on the basis of historical precedent and common practice, but did not make it a requirement because system administration is not within the scope of this standard. POSIX does not specify /var/tmp. The FHS does though: The /var/tmp directory is made available for programs that require temporary files or directories that are preserved between system reboots. Therefore, data stored in /var/tmp is more persistent than data in /tmp. Files and directories located in /var/tmp must not be deleted when the system is booted. Although data stored in /var/tmp is typically deleted in a site-specific manner, it is recommended that deletions occur at a less frequent interval than /tmp."}
{"doc_id": 164538, "author": "MetaColon", "text": "If youre phone is rooted or you have a custom recovery (like TWRP), this is actually much easier. The only thing youll have to do, is to add the following line to your build.prop file located in /system: ro.config.media_vol_steps=30 Where 30 represents the number of steps. This can be done with a root file explorer (like Root Browser) or via VI in the TWRP terminal or via adb."}
{"doc_id": 623291, "author": "dan", "text": "A DHCP server is answering with a DHCP OFFER to provide an IP address. It knows the target MAC and IP, hence will use a unicast IP packet, toward the originating Ethernet address, hence a unicast Ethernet frame too. If you want to see it for real, just enter the following command on your DHCP server: tcpdump -imy_ethernet_device-e src port bootps where my_ethernet_device is the name of the Ethernet interface on which your DHCP server is replying to your network."}
{"doc_id": 99002, "author": "Paul", "text": "Yes, you can use multiple charging cases. Put the AirPods in either charging case to see the AirPod charge level and the battery level of that particular charging case. At the moment, once of my cases shows 94%. Moving the AirPods to the other case shows a 100% case charge level."}
{"doc_id": 262842, "author": "JdeBP", "text": "chaos answer is what some documentation says. But its not what systemd actually does. (Its not what van Smoorenburg rc did, either. The van Smoorenburg rc most definitely did not ignore LSB headers, which insserv used to calculate static orderings, for starters.) The Freedesktop documentation, such as that Incompatibilities page, is in fact wrong, on these and other points. (The HOME environment variable in fact is often set, for example. This went wholly undocumented anywhere for a long time. Its now documented in the manual, at least, but that Freedesktop WWW page still hasnt been corrected.) The native service format for systemd is the service unit. systemds service management proper operates solely in terms of those, which it reads from one of nine directories where (system-wide) .service files can live. /etc/systemd/system, /run/systemd/system, /usr/local/lib/systemd/system, and /usr/lib/systemd/system are four of those directories. The compatibility with van Smoorenburg rc scripts is achieved with a conversion program, named systemd-sysv-generator. This program is listed in the /usr/lib/systemd/system-generators/ directory and is thus run automatically by systemd early in the bootstrap process at every boot, and again every time that systemd is instructed to re-load its configuration later on. This program is a generator, a type of ancillary utility whose job is to create service unit files on the fly, in a tmpfs where three more of those nine directories (which are intended to be used only by generators) are located. systemd-sysv-generator generates the service units that run the van Smoorenburg rc scripts from /etc/init.d, if it doesnt find a native systemd service unit by that name already existing in the other six locations. systemd service management only knows about service units. These automatically (re-)generated service units are written to invoke the van Smoorenburg rc scripts. They have, amongst other things: [Unit] SourcePath=/etc/init.d/wibble [Service] ExecStart=/etc/init.d/wibble start ExecStop=/etc/init.d/wibble stop Received wisdom is that the van Smoorenburg rc scripts must have an LSB header, and are run in parallel without honouring the priorities imposed by the /etc/rc?.d/ system. This is incorrect on all points. In fact, they dont need to have an LSB header, and if they do not systemd-sysv-generator can recognize the more limited old RedHat comment headers (description:, pidfile:, and so forth). Moreover, in the absence of an LSB header it will fall back to the contents of the /etc/rc?.d symbolic link farms, reading the priorities encoded into the link names and constructing a before/after ordering from them, serializing the services. Not only are LSB headers not a requirement, and not only do they themselves encode before/after orderings that serialize things to an extent, the fallback behaviour in their complete absence is actually significantly non-parallelized operation. The reason that /etc/rc3.d didnt appear to matter is that you probably had that script enabled via another /etc/rc?.d/ directory. systemd-sysv-generator translates being listed in any of /etc/rc2.d/, /etc/rc3.d/, and /etc/rc4.d/ into a native Wanted-By relationship to systemds multi-user.target. Run levels are obsolete in the systemd world, and you can forget about them. Further reading systemd-sysv-generator. systemd manual pages. Freedesktop.org. Environment variables in spawned processes. systemd.exec. systemd manual pages. Freedesktop.org. https://unix.stackexchange.com/a/394191/5132 https://unix.stackexchange.com/a/204075/5132 https://unix.stackexchange.com/a/196014/5132 https://unix.stackexchange.com/a/332797/5132"}
{"doc_id": 557766, "author": "Jason Parms", "text": "SSL certificate is used for two purposes. One is securing online transactions and private information which is transmitted between a web browser and a web server. Second is Trust, SSL is used for increase customer confidence. SSL proves secure session of your website, it means your customer trust on your website. Each certificate has own validation process and following this process certificate authority validates your business reliability and send a certificate for your website. A basic cheap SSL certificate only validates your domain authority and authenticated using the approver email verification system. Approver can easily get this certificate in just minutes with a generic email address. OV and EV SSL certificates plugged with customer’s trust and through its strict authentication process, it gives the highest level of trust. EV SSL validates manifold components of identifying your domain and business information. It follows manual verification process and during this process system fails to verify or system defendants your business for potential false action then your order may be lined up for manual review. The main difference in trust factor and brand reputation, while your customers see the green address bar in your browser then they feel more secure and encourage to make transactions. Otherwise, some differences between other features like encryption, browser compatibility, key length, mobile supports, etc. Otherwise, certificates warranty explains differences. Certificate authorities provide extended warranty ($1K to $1.75M) against mis-issuance of an SSL certificate which explains the worth of your investment for website security. While we focus on the price of a certificate, it doesnt matter where to buy your certificate – certificate authority or an authorized reseller. Authorized reseller offers same SSL products, same security features, better support at reasonably priced. Jason Parm is affiliated with SSL2BUY (Global SSL Reseller)"}
{"doc_id": 426700, "author": "Tom Squires", "text": "They are mostly used for code reusability. If you code to the interface you can use a diffrent class that inherits from that interface and not break everything. Also they are very usefull in webservices where you want to let the client know what a class does (so they can consume it) but dont want to give them the actual code."}
{"doc_id": 426704, "author": "Falcon", "text": "Interfaces are the backbone of (static) polymorphism! The interface is what matters. Inheritance would not work without interfaces, as subclasses basically inherit the already implemented interface of the parent. How often you make uses of them and what makes you do so ?? Pretty often. Everything that needs to be pluggable is an interface in my applications. Often times you have otherwise unrelated classes that need to provide the same behaviour. You cant solve such problems with inheritance. Need different algorithms to perform operations on the same data? Use an interface (see strategy pattern)! Do you want to use different list implementations? Code against an interface and the caller does not need to worry about the implementation! Its been considered a good practice (not only in OOP) to code against interfaces for ages, for one single reason: Its easy to change an implementation when you realize it does not fit your needs. Its pretty cumbersome if you try to achieve that only with multiple inheritance or it boils down to creating empty classes in order to provide the necessary interface."}
{"doc_id": 590547, "author": "Klaws", "text": "With deep packet inspection, the ISP can detect most VPN protocols (not the data encrypted in the VPN packets, just that there is VPN traffic) and block it. Some companies do this to ensure that they can decrypt all traffic (with the MITM attack and forged certificates to have DPI on SSL as well). The idea is to force you to use insecure communication channels by preventing everything else. Note that these insecure channels might be more secure , from the companys point if view, as they can do Data Leakage Prevention there. In such a case, non-standard VPN techniques, like HTTP tunneling might be an option. Note that the terms of use might disallow measures to circumvent DPI. Edit: some ISPs use DPI for traffic shaping. They dont log all the transmitted data, they just check (for example) for BitTorrent traffic and assign it a lower priority or limited bandwidth. Now, they are not stealing your password, just the bandwidth you are paying for...."}
{"doc_id": 426708, "author": "Jesse C. Slicer", "text": "Use of interfaces helps a system stay decoupled and thus easier to refactor, change, and redeploy. It is a very core concept to object-oriented orthodoxy and I first learned about it when C++ gurus made pure abstract classes which are quite equivalent to interfaces."}
{"doc_id": 99028, "author": "Sunil Gill", "text": "There are many ways to find mac task manager. Easiest one is to use spotlight. Just type Activity monitor i.e mac task manager. If you wish to just force quit an app or process. You can just use this shortcut: Alt + Command (⌘) + Esc Source: Mac Activity Monitor"}
{"doc_id": 426711, "author": "Sheldon Warkentin", "text": "Interfaces are the best way to maintain well decoupled constructs. When writing tests, you will find that concrete classes will not work in your test environment. Example: You want to test a class that depends on a Data Access Service class. If that class is talking to a web service, or database -- your unit test will not run in your test environment ( plus it has turned into an integration test ). Solution? Use an Interface for your Data Access Service and Mock that interface so you can test your class as a unit. On the other hand, WPF & Silverlight do not play at all with Interfaces when it comes to binding. This is a pretty nasty wrinkle."}
{"doc_id": 66266, "author": "Erik Berkun-Drevnig", "text": "In Mavericks there is an option to open a new terminal window at the folder you have highlighted in Finder. To enable this option go to Finder -> Services -> Service Preferences and check New Terminal at Folder. Then use it from the Finder menu:"}
{"doc_id": 99051, "author": "Gilad Shahrabani", "text": "A bit of an old question but in iTerm2 this helped me: iTerm2 → Preferences → keys → Add key mapping: command + w => ignore"}
{"doc_id": 590576, "author": "Xiong Chiamiov", "text": "Restricting your available pool of numbers reduces the number of possible solutions, making it less secure. Repeating digits is a common human weakness when choosing pin codes, which means it will be tried first by attackers. Thus, ruling out repeated numbers increases security. As is often the case, the decision has both upsides and downsides depending on the specific attack youre defending against. You probably shouldnt over-think it, and consider wider-perspective changes (like not using a 4-digit pin, or adding a second factor, or having lockouts on incorrect tries) if you want to increase the security of the system."}
{"doc_id": 754, "author": "raimue", "text": "iStat Menus has the functionality you are asking for. It is available starting at USD$14.39 for a single license or $17.99 for a family pack (up to five different Macs)."}
{"doc_id": 755, "author": "Michael H.", "text": "I use MenuMeters for this functionality, and have a hard time living without it. How do other people know when their web browser is finally done downloading a page, or YouTube stalled out, or iPhoto still working, or ...? MenuMeters is freeware, but well worth the donation. The original author has stopped maintaining MenuMeters, but someone new has taken over for El Capitan."}
{"doc_id": 262899, "author": "leden", "text": "Here are some additional points about aliases and functions: Same-named alias and function can co-exist alias namespace is looked up first (see first example) aliases cannot be (un)set in subshells or non-interactive environment (see second example) For example: alias f=echo Alias; f # prints Alias function f { echo Function; }; f # prints Alias unalias f; f # prints Function As we can see, there are separate namespaces for aliases and functions; more details can be found using declare -A -p BASH_ALIASES and declare -f f, which prints their definitions (both are stored in memory). Example showing limitations of aliases: alias a=echo Alias a # OK: prints Alias eval a; # OK: prints Alias ( alias a=Nested; a ); # prints Alias (not Nested) ( unalias a; a ); # prints Alias bash -c alias aa=Another Alias; aa # ERROR: bash: aa: command not found As we can see aliases are not nestable, unlike functions. Also, their usage is limited to the interactive sessions. Finally, note that you can have arbitrary computation in an alias by declaring a function a immediately calling it, like so: alias a_complex_thing=f() { do_stuff_in_function; } f which is already in widespread use in case of Git aliases. The benefit of doing so over declaring a function is that your alias cannot be simply overwritten by source-ing (or using .) a script which happens to declare a same-named function."}
{"doc_id": 66294, "author": "beporter", "text": "Also available are iosnoop and iotop depending on your specific needs. These terminal commands can be piped through grep to watch for filesystem events from a specific process or against a specific file."}
{"doc_id": 131832, "author": null, "text": "my understanding is that different mod/rom is similar to likes of ubuntu and fedora (different variant of linux) in PC world. Kernel is lower level than this, like both ubuntu 10.10 and fedora 14 are using the same linux kernel 2.6.35"}
{"doc_id": 590586, "author": "Dmitry Grigoryev", "text": "This really depends on how the PIN is created: If the PIN is generated, make sure the distribution is uniform and dont exclude any combinations. That will maximize the entropy. If the PIN is chosen by a human operator, it makes perfect sense to exclude some combinations. I wouldnt go as far as rejecting half of the combinations, but if you do, you should also consider reject PINs starting with 0 1 and 2 (think birth years and dates) then PINs corresponding to physical key layouts like 2580 and 1379 and so on and so forth. Just make sure you stop before you end up allowing a single 8068 PIN which this study has found to be the least probable. What you should do for human-chosen PINs is excluding the most common combinations: 1234 and 1111 alone account for almost 17% of all PINs in use, and 20 most popular PINs account for almost 27%. Those include each digit repeated 4 times and popular combinations like 1212 and 4321. Edit: on a second thought, I think you should exclude most common combinations in any case. Even if your PIN is randomly generated, the attacker may not know that, in which case they will most probably try those combinations first."}
{"doc_id": 33545, "author": "user199576", "text": "You could also take a look as ZOC6 seems pretty cool. ZOC6 product page"}
{"doc_id": 590603, "author": "J.A.K.", "text": "It depends on the implementation. Eliminating consecutive numbers will reduce the keyspace by .1% but has some benefits to physical security that may make it worth the tradeoff. A lot of good clever answers here, main point being that instead of making it more secure, youre making the keyspace smaller (however negibly, 10 out of 10.000). The top answers however fail to touch on the physical aspect of entering a pin. Visual and thermovisual extraction are a real danger these days. In other words, bad guys shoulder-surfing your pincode either with their eyes, a telescope, a skimming camera on the ATM or even thermal imaging cameras. That last one is more recent, and especially nasty as a skimmer can walk up to a pin pad and look at the heat signature, even if you covered the pad well. Having a consecutive pin will hurt security in this area; it reduces the complexity of the physical location of the numbers by a horrible amount. Even if you covered your hand, chances are the attacker will guess the button you pressed four times before a lockout happens. On a phone, if there is a big grease spot on the zero, thats the one ill try first."}
{"doc_id": 164626, "author": "bers", "text": "I am amazed no one has mentioned the Google solution, Datally. No root required. More information on the Google blog: https://blog.google/technology/next-billion-users/meet-datally-new-way-understand-control-and-save-mobile-data/ Or download immediately from the Play Store: https://play.google.com/store/apps/details?id=com.google.android.apps.freighter"}
{"doc_id": 197401, "author": "sarath", "text": "Whenever you delete a file using rm command, the files data is never deleted. In other words the blocks in the file system containing data is still there. What happens is when you run the rm command, the system marks the inode belonging to that file as unused and the data blocks of that file also as unused (but not wiped out). However ext3 zeros most of the fields in the inode, when a file is deleted. This normal marking of unused is done for the speed... Otherwise for deletion it will take some more time. Thats why you might have noted deleting even large files are faster (you can recover the data if that data blocks are not overwritten). More Info: Inode Structure, How file deletion works"}
{"doc_id": 590618, "author": "Ludwig Behm", "text": "Lets add a real example why this can be a good security improvement. Lets say your coworker or whoever found out about your webmailer password (say GMail 7years ago, without 2 factor). The attacker gets access into the webinterface to change your password (imagine some reasons) and via POP3 into your mails. Because Google is a huge network, it needs some time that old passwords are disabled for POP3 access. This gives the attacker the possibility to reset your password again and again. Even if you regain access with the reset function and validate yourself with your mailbox access on your smartphone or an reset strategy via SMS to your smartphone, the attacker (who still has access to your mailbox via POP3 with the old or his own passwords) can reset your password. With such an attack the victim cant be lock you out forever, because the attacker cant remove a reset strategy like a SMS number - but it surly states a very high risk. This attack vector is easily preventable, if password changes are possible only every 24 hours."}
{"doc_id": 230175, "author": "Florian Bidabé", "text": "Filtered port statement from nmap differs according your scan method. The standard scan (TCP Scan if unprivileged user, or Half-Open scan -sS if superuser) relies on TCP protocol . (named 3-way hanshake) A client (you) issues a SYN, if the server replies SYN/ACK : it means that the port is open ! You issue a SYN, if the server replies RST : it means that the port is close ! You issue a SYN, if the server does not reply, or replies with ICMP error : it means that the port is filtered. Likely an IDS / statefull firewall block your request) To figure what is the real status of the port, you can : use the -sV, or -A option (version detection, it will help you to determine what is the status of this port. use --tcp-flags SYN,FIN to try bypassing the fw. use other scan types (http://nmap.org/book/man-port-scanning-techniques.html) The excellent Nmap Network Discovery book, written by its creator Fyodor explains this very well. I quote filtered : Nmap cannot determine whether the port is open because packet filtering prevents its probes from reaching the port. The filtering could be from a dedicated firewall device, router rules, or host-based firewall software. These ports frustrate attackers because they provide so little information. Sometimes they respond with ICMP error messages such as type 3 code 13 (destination unreachable: communication administratively prohibited), but filters that simply drop probes without responding are far more common. This forces Nmap to retry several times just in case the probe was dropped due to network congestion rather than filtering. This sort of filtering slows scans down dramatically. open|filtered : Nmap places ports in this state when it is unable to determine whether a port is open or filtered. This occurs for scan types in which open ports give no response. The lack of response could also mean that a packet filter dropped the probe or any response it elicited. So Nmap does not know for sure whether the port is open or being filtered. The UDP, IP protocol, FIN, NULL, and Xmas scans classify ports this way. closed|filtered : This state is used when Nmap is unable to determine whether a port is closed or filtered. It is only used for the IP ID Idle scan discussed in Section 5.10, TCP Idle Scan (-sl)"}
{"doc_id": 131874, "author": "Matt H", "text": "The about:debug menu on the HTC Desire HD has an option under Menu > More > Settings called Enable GEP Zoom. This turns off HTCs Text reflow feature and uses the default Google zoom."}
{"doc_id": 623395, "author": "Robert", "text": "According to the OSPF RFC 2328 (10.6): If the Interface MTU field in the Database Description packet indicates an IP datagram size that is larger than the router can accept on the receiving interface without fragmentation, the Database Description packet is rejected. The simple answer is that the standard was designed to just drop datagrams which are too large instead of fragmenting them. Fragmented traffic increases the CPU burden of a device and decreases performance because of the need for the fragmentation needed extra traffic. Considering the goal of a dynamic routing protocol is it be a stable and fast converging protocol, anything contrary to those goals should be eliminated. Setting the requirement for the MTUs to match helps enforce this performance requirement. More from the OSPF RFC: 4.3. Routing protocol packets The OSPF protocol runs directly over IP, using IP protocol 89. OSPF does not provide any explicit fragmentation/reassembly support. When fragmentation is necessary, IP fragmentation/reassembly is used. OSPF protocol packets have been designed so that large protocol packets can generally be split into several smaller protocol packets. This practice is recommended; IP fragmentation should be avoided whenever possible."}
{"doc_id": 131877, "author": "Lie Ryan", "text": "Rooted phones are just as secure as an unrooted phones if you never grant root permission to any apps. The problem is that if you root your phone, youre bound to give root permission (otherwise, why are you rooting your phone in the first place), and applications that you give root permission may turned out to be rogue or leak their permission to allow an untrusted applications to gain root-like permission. Running rooted phone is safe as long as you know which app to give root access and which are not. Problem is, even assuming that you only pick trustworthy apps they still can leak permissions inadvertantly (in security parlance, this is called confused deputy problem), so you must really be careful when choosing trusted apps."}
{"doc_id": 361254, "author": "DustWolf", "text": "Here, a copypaste you can immediately use: cat list.txt | xargs -I{} command parameter {} parameter The item from the list will be put where the {} is and the rest of the command and parameters will be used as-is."}
{"doc_id": 99113, "author": "poige", "text": "From my own pain^W experience I can tell that this service is needed at least for text message forwarding (relaying) to work. Having it blocked with Firewall, for e. g., puts a big bold ban on Text Message Forwarding item in iPhones settings. In fact it wont be even shown at all there"}
{"doc_id": 557867, "author": "Babken Vardanyan", "text": "To add to what has already been said, I can think of 2 more reasons why changing passwords regularly is helpful: 1) When computational power raises substantially Say, in early 90s 7-char passwords were considered secure because computers werent nearly powerful enough to bruteforce them. 24 years later systems which still have the same password can be successfully bruteforced. Some calculations, considering the password consists of 24 letters (uppercase and lowercase), 10 numbers and 10 symbols, and Moores law (x2 more power every 2 years): possible combinations = (24 + 24 + 10 + 10) ^ 7 = 6,722,988,818,432 tries per second in 1990 = 100,000 (for example) time required in 1990 = possible combinations / tries per second = 2 years tries per second in 2014 = tries per second in 1990 * (2 ^ 12) = 409,600,000 time required in 2014 = possible combinations / tries per second = 4 hours This is more about increasing minimum required password length, but it should be done regularly and short passwords should be changed. 2) Compliance with ISO/IEC 27001/27002 standards From ISO/IEC 27002:2013, section 9.4.3: A password management system should: ... e) enforce regular password changes and as needed; 3) Compliance with PCI DSS standard From PCI DSS v3, section 8.2.4: 8.2.4 Change user passwords/passphrases at least every 90 days. 8.2.4.a For a sample of system components, inspect system configuration settings to verify that user password parameters are set to require users to change passwords at least every 90 days. 8.2.4.b Additional testing procedure for service providers: Review internal processes and customer/user documentation to verify that: Non-consumer user passwords are required to change periodically; and Non-consumer users are given guidance as to when, and under what circumstances, passwords must change. Passwords/phrases that are valid for a long time without a change provide malicious individuals with more time to work on breaking the password/phrase."}
{"doc_id": 33582, "author": "minnow", "text": "Another option is to enable the Use PC Style Home/End setting in Karabiner (formerly KeyRemap4MacBook): The setting is defined in Resources/include/checkbox/for_pc_users.xml. You can also save a file like this as ~/Library/Application Support/KeyRemap4MacBook/private.xml: <?xml version=1.0?> <root> <appdef> <appname>HOMEENDIGNORE</appname> <equal>com.microsoft.Word</equal> <equal>com.microsoft.Powerpoint</equal> <equal>com.microsoft.Excel</equal> <equal>com.vmware.fusion</equal> <prefix>com.vmware.proxyApp.</prefix> </appdef> <item> <name>homeend</name> <identifier>homeend</identifier> <not>HOMEENDIGNORE</not> <autogen>__KeyToKey__ KeyCode::HOME, ModifierFlag::NONE, KeyCode::A, VK_CONTROL</autogen> <autogen>__KeyToKey__ KeyCode::END, ModifierFlag::NONE, KeyCode::E, VK_CONTROL</autogen> <autogen>__KeyToKey__ KeyCode::HOME, VK_SHIFT | ModifierFlag::NONE, KeyCode::A, VK_CONTROL | VK_SHIFT</autogen> <autogen>__KeyToKey__ KeyCode::END, VK_SHIFT | ModifierFlag::NONE, KeyCode::E, VK_CONTROL | VK_SHIFT</autogen> </item> </root> Then open the KeyRemap4MacBook application, press the ReloadXML button, and enable the setting. See https://pqrs.org/macosx/keyremap4macbook/xml.html.en for more information."}
{"doc_id": 816, "author": "mmmmmm", "text": "It is usually better to keep permissions as strict as possible. Keeping /usr/local owned by root means that only processes that run as root/sudo (or ask for admin user via the Apple authorization dialog box) can write to this area. Thus, a process download has to ask you for a password before corrupting files there. But as you say, it makes adding new programs harder. I am OK with running sudo, as you install things less often than running them but you have to trust that the build process does not change anything it should. If you want to avoid sudo I would install Homebrew into ~/usr/local and alter your path, manpath etc to include the directories under there. A better way is to create another user—say, homebrew and create a directory owned by that user. Then, install there using sudo -U homebrew. Other users will have the benefit of not being able to overwrite any other files, because they are not running as root and other programs cannot affect homebrew. (I note that the Homebrew FAQ does suggest this new user if you are in a multi user environment. I would say that any Unix machine including macOS is a multi user environment) However as the Homebrew wiki says the recipes dont find all cases of /usr/local and replace them with the chosen directory I suspect we are stuck with /usr/local."}
{"doc_id": 459579, "author": "Scott Whitlock", "text": "Yes, splitting long functions is normal. This is a way of doing things thats encouraged by Robert C. Martin in his book Clean Code. Particularly, you should be choosing very descriptive names for your functions, as a form of self-documenting code."}
{"doc_id": 426816, "author": "keppla", "text": "For me, it was the other way around because i liked programming, i was good at math, because for most concepts, i had a practical application, starting simple with logic (x and y or z), to simpler analysis (ok, f(x) is a function. i know that, that even looks exactly like the functions in Pascal. go on), to higher stuff (a mapping |R -> |R? ah, thats like a Dictionary with floats as keys and values). I was often surprised, that math was not just not that hard, but instead provided me a much easier way of thinking about my programming problems than those clumsy, pragmatic languages i was coding in ever could."}
{"doc_id": 164679, "author": "Firelord", "text": "As of now, many apps can show the package name of the installed app, such as Elixir 2 (see Applications option), My App List, Applications Info and many more in Play Store. Screenshots of the ones I use:"}
{"doc_id": 557900, "author": "Kaz", "text": "Whether or not the hash is salted only makes a difference if the attacker has the password hash. Without a salt, the hash can be attacked with a rainbow table: a pre-computed dictionary which associates passwords with hashes. An N-bit salt increases the storage requirement for a rainbow table, and the time to compute that table, by a factor of 2**N. So for instance, with a 32 bit salt, just a single rainbow table dictionary entry, say for the password passw0rd, requires many gigabytes of storage, making such a rainbow table very expensive using current storage hardware. So when a salt is present, the attacker is reduced to a brute force attack on the specific set of password hashes that have been obtained. However: for weak passwords, a brute force attack will succeed in relatively little time. sufficiently strong passwords will not be found in a rainbow table. if the attacker has access to the hashes, system security has been compromised already: modern systems and protocols do not reveal their password hashes. If the attacker is not able to gain access to the password database, the passwords may as well be stored in plaintext. if an attacker must compromise the system to get to the hashes in order to reverse passwords from them, then the only passwords which have value to the attacker are those which are re-used for other security domains to which the attacker has no access yet. Passwords which are not reused have no value (and certainly less value than other sensitive information associated with the accounts). Say user joewestlake uses the password god1234. The attacker reverses this instantly using a rainbow table. (Or within mere minutes of cracking using a brute-force attack, if the hash is salted, since the password is so bad.) Now the problem is that joewestlake also used god1234 for his Gmail account, and for online banking, oops! Now the attacker reads Joes e-mails, and learns enough about Joe so that he can easily answer the question what was the name of your first pet when logging in to Joes online banking. So, the rationale for salts is that they somewhat protect users by making medium-security passwords harder to reverse: passwords which, without a salt, could reasonably be expected to be found in a rainbow table, but which are strong enough that individually brute-forcing them takes a very long time. But salts provide this benefit only in the event that the hashes are compromised, which is already a serious security breach, and the benefit is only for those users who re-use their medium-security passwords in other systems. Say Joe instead used a password made of 10 random alphanumeric characters and symbols. This could still be in a rainbow table, but takes a lot of work crack. So even if Joe used the same password for Gmail and online banking, he is safe, thanks to the salt. The cracker runs his brute-force crack for perhaps several hours, maybe days. The crack yields numerous weak passwords from others users of the same system who have weak passwords. The attacker is satisfied with that yield and stops cracking; Joes password is never reversed. Furthermore, if the breach is detected and users (including Joe) are advised to change their passwords, then Joe has a chance to outrun the attackers cracking attempts, even if the attacker persists in attacking the entire medium-security password space that includes Joes password. Joe knows that, the password he used on the compromised system is exactly the same as his Gmail and banking password, so he scrambles to change those other two. The salt helps here because it buys time for password-reusing users to change their password. The salt wont help those with very weak passwords which are cracked in minutes, but users of passwords which take hours or days to crack have a fighting chance."}
{"doc_id": 492370, "author": "Ixrec", "text": "Because as you say, protected still leaves you with the ability to modify the implementation completely. It doesnt genuinely protect anything inside the class. Why do we care about genuinely protecting the stuff inside the class? Because otherwise it would be impossible to change implementation details without breaking client code. Put another way, people who write subclasses are also the outer world for the person who wrote the original base class. In practice, protected members are essentially a class public API for subclasses and need to remain stable and backwards compatible just as much as public members do. If we did not have the ability to create true private members, then nothing in an implementation would ever be safe to change, because you wouldnt be able to rule out the possibility that (non-malicious) client code has somehow managed to depend on it. Incidentally, while In OOP, sooner or later, you are going to make a subclass of a class is technically true, your argument seems to be making the much stronger assumption that sooner or later, you are going to make a subclass of every class which is almost certainly not the case."}
{"doc_id": 492371, "author": "Sebastian Redl", "text": "In OOP, sooner or later, you are going to make a subclass of a class This is wrong. Not every class is meant to be subclassed and some statically typed OOP languages even have features to prevent it, e.g., final (Java and C++) or sealed (C#). it is good to understand and being able to modify the implementation completely. No, its not. Its good for a class to be able to clearly define its public interface and preserve its invariants even if it is inherited from. In general, access control is about compartmentalization. You want an individual part of the code to be understood without having to understand in detail how it interacts with the rest of the code. Private access allows that. If everything is at least protected, you have to understand what every subclass does in order to understand how the base class works. Or to put it in the terms of Scott Meyers: private parts of a class are affected by a finite amount of code: the code of the class itself. Public parts are potentially affected by every bit of code in existence, and every bit of code yet to be written, which is an infinite amount of code. Protected parts are potentially affected by every existing subclass, and every subclass yet to be written, which is also an infinite amount of code. The conclusion is that protected gives you very little more than public, whereas private gives you a real improvement. It is the existence of the protected access specifier that is questionable, not private."}
{"doc_id": 492372, "author": "Robbie Dee", "text": "Yes, private fields are absolutely necessary. Just this week I needed to write a custom dictionary implementation where I controlled what was put into the dictionary. If the dictionary field were to be made protected or public, then the controls Id so carefully written could have been easily circumvented. Private fields are typically about providing safeguards that the data is as the original coder expected. Make everything protected/public and you ride a coach and horses through those procedures and validation."}
{"doc_id": 850, "author": "John P. Neumann", "text": "Its already been answered, but heres my 2 cents. Via Bash through the terminal find ~ -type f -name *pdf or find ~ -iname *pdf (or, if you want to ignore error messages, find ~ -type f -name *pdf 2>/dev/null) or you can use this to search for a string in a file: find ~ -iname *txt | xargs grep string you want This may not return anything on a pdf, but it will work on most other file types (text, php, py, html, etc)."}
{"doc_id": 492374, "author": "Ben Cottrell", "text": "private variables in a class are better than protected for the same reason that a break statement inside a switch block is better than a goto label statement; which is that human programmers are error-prone. protected variables lend themselves to un-intentional abuse (programmer mistakes), just as the goto statement lends itself to the creation of spaghetti code. Is it possible to write working bug-free code using protected class variables? Yes of course! Just as its possible to write working bug-free code using goto; but as the cliche goes Just because you can, doesnt mean you should! Classes, and indeed the OO paradigm, exist to guard against hapless error-prone human programmers making mistakes. The defense against human mistakes is only as good as the defensive measures built into the class. Making the implementation of your class protected is the equivalent of blowing an enormous hole in the walls of a fortress. Base classes have absolutely no knowledge of derived classes. As far as a base class is concerned, protected does not actually give you any more protection than public, because theres nothing stopping a derived class from creating a public getter/setter which behaves like a backdoor. If a base class permits un-hindered access to its internal implementation details, then it becomes impossible for the class itself to defend against mistakes. Base classes have absolutely no knowledge of their derived classes, and therefore have no way of guarding against mistakes made in those derived classes. The best thing a base class can do is hide as much of its implementation as possible as private and put enough restrictions in place to guard against breaking changes from derived classes or anything else outside of the class. Ultimately, high-level languages exist to minimise human errors. Good programming practises (such as SOLID principles) also exist to minimise human errors. Software developers who ignore good programming practices have a much higher chance of failure, and are more likely to produce broken unmaintainable solutions. Those who follow good practices have a much lower chance of failure, and are more likely to produce working maintainable solutions."}
{"doc_id": 197469, "author": "gertvdijk", "text": "Good answer is already posted by @StevenD, yet I think this might clarify it a bit more. The reason that the process is killed on termination of the terminal is that the process you start is a child process of the terminal. Once you close the terminal, this will kill these child processes as well. You can see the process tree with pstree, for example when running kate & in Konsole: init-+ ├─konsole─┬─bash─┬─kate───2*[{kate}] │ │ └─pstree │ └─2*[{konsole}] To make the kate process detached from konsole when you terminate konsole, use nohup with the command, like this: nohup kate & After closing konsole, pstree will look like this: init-+ |-kate---2*[{kate}] and kate will survive. :) An alternative is using screen/tmux/byobu, which will keep the shell running, independent of the terminal."}
{"doc_id": 459618, "author": "Fred", "text": "Im sure this wont be the popular opinion, but its perfectly ok. Locality of Reference can be a huge aid in making sure you and others understand the function (in this case Im referring to the code and not to memory specifically). As with everything, its a balance. You should be more concerned with anyone who tells you always or never."}
