{"doc_id": 229377, "author": "Gilles 'SO- stop being evil'", "text": "The primary command to manipulate deb packages is dpkg-deb. To unpack the package, create an empty directory and switch to it, then run dpkg-deb to extract its control information and the package files. Use dpkg-deb -b to rebuild the package. mkdir tmp dpkg-deb -R original.deb tmp # edit DEBIAN/postinst dpkg-deb -b tmp fixed.deb Beware that unless your script is running as root, the files permissions and ownership will be corrupted at the extraction stage. One way to avoid this is to run your script under fakeroot. Note that you need to run the whole sequence under fakeroot, not each dpkg-deb individually, since its the fakeroot process that keeps the memory of the permissions of the files that cant be created as they are. fakeroot sh -c  mkdir tmp dpkg-deb -R original.deb tmp # edit DEBIAN/postinst dpkg-deb -b tmp fixed.deb  Rather than mess with permissions, you can keep the data archive intact and modify only the control archive. dpkg-deb doesnt provide a way to do that. Fortunately, deb packges are in a standard format: theyre ar archives. So you can use ar to extract the control archive, modify its files, and use ar again to replace the control archive by a new version. mkdir tmp cd tmp ar p ../original.deb control.tar.gz | tar -xz # edit postinst cp ../original.deb ../fixed.deb tar czf control.tar.gz *[!z] ar r ../fixed.deb control.tar.gz You should add a changelog entry and change the version number if you modify anything in the package. The infrastructure to manipulate Debian packages assumes that if two packages have the same name and version, theyre the same package. Add a suffix to the debian_revision part at the end of the version number; for sorting reasons the suffix should start with ~, e.g. 1.2.3-4.1 becomes 1.2.3-4.1~johnjumper1. Instead of using shell tools, you can use Emacs. The dpkg-dev-el package (which is its own upstream as this is a native Debian package) contains modes to edit .deb files and to edit Debian changelogs. Emacs can be used interactively or scripted."}
{"doc_id": 6, "author": "Adam Dempsey", "text": "You can use StartSound.PrefPane which basically just sets the volume to 0 when you shutdown and then turns it back up after login."}
{"doc_id": 131078, "author": null, "text": "http://abtevrythng.blogspot.com/2010/06/adding-cer-certificates-on-your-android.html Shows how to actually achieve this. Worked fine for me. Try it out. In this article .cer to .pfx (which is what you need on Android) conversion is given. Simple method is given using which you can convert .cer to .pfx and use it to connect to the Wi-Fi network. Plus you dont need any Key to convert .cer to .pfx!!!"}
{"doc_id": 65554, "author": "user132360", "text": "In App purchases are not shared in Family sharing and its clearly given in apple website. But what we can do is log in to iTunes & App store using the ID which was used to buy the in app purchases without having to change the primary ID of the device and still enjoy the in app purchases"}
{"doc_id": 34, "author": "Shane Stillwell", "text": "I would recommend installing QuickSilver. Its an application launcher that will remember the applications you launch most frequent and recommend them first. Its easy to launch any application with a few keystrokes. QuickSilver is the first Application I install on every new Mac."}
{"doc_id": 35, "author": "Scott", "text": "Not built-in to the OS, but Ive been using a free utility called Visor. What you do with it is leave your Terminal running in the background, but Visor hides it and invokes it in a Quake-style console when you hit a (user-configurable) key combo. Its pretty customizable as to how your Terminal shows/hides. Super awesome."}
{"doc_id": 37, "author": "jdiaz", "text": "If you enable screen locking within the screen saver pref pane you can put the computer to sleep and lock at the same time by pressing ⌘+⌥+F12"}
{"doc_id": 38, "author": "Josh K", "text": "⇧+⌘+⌥+Q will perform a quick logout. Another option is to enable a password when waking from sleep or screen saver and adding a hot corner for one or the other. Then locking is as simple as tossing a mouse in a corner."}
{"doc_id": 39, "author": "Scott", "text": "Via the Expose system preferences panel you can set a hot corner of your monitor that activates your screen saver. Say you set the Bottom Left corner, as soon as you move your mouse there the screen saver will invoke. If youve set a password on it, bingo, done. Yet another option is to enable Fast User Switching in the Login Options pane of the Accounts preferences panel. This puts a Users menu in the top right hand corner, from which you can quickly choose Login Window.... This kicks you to the login screen, requiring a password to move away from, and also does not end your session/quit any running apps."}
{"doc_id": 32805, "author": "TJ Luoma", "text": "I think the answer to your question is No, there isnt a command line way to do this. Because this is a menu bar item, its not something that you can access easily using Keyboard Maestro or another similar tool. However, if you are not averse to a solution using a 3rd party app, QuickLock will let you do this. Its a free (donations accepted) app which will let you assign a keyboard shortcut to lock the screen. Theres also a menu bar item which you can click to lock the screen. The app will let you set a password (separate from your account password). It does not require the use of password with screensaver, its all completely separate. You can see a video of it in action at http://www.youtube.com/watch?v=SBHwykPB19o p.s. when the screen is locked, type your password to unlock it. I was confused because I expected to see a password field. There is none. You just type the password. p.p.s. Ive only used this for a few minutes, so there may be some other issues with it Im not aware of, but it seems to fit the bill."}
{"doc_id": 44, "author": "zneak", "text": "Your Mac can ask your password after it wakes up if you set it to do so in the Preferences panel (Security). From there on, you can use ⌥+⌘+⏏ to put your Mac to sleep. So all you have to do is hit that and walk away."}
{"doc_id": 46, "author": "Nagon", "text": "On macOS High Sierra, there is a standard key sequence and Apple menu item to lock your screen. Control-Command-Q or ^+⌘+Q For older OS, ⇧+⌃+⏏ puts the display (only the display, not the whole computer) to sleep and will then prompt you for a password if you have enabled Require password [amount of time] after sleep or screen saver begins under System Preferences > Security. If your Mac does not have an ⏏ (eject) key, you can use ⇧+⌃+⌽ (power)."}
